[
{"date": "2019-09-14 08:01", "link": "https://newyork.craigslist.org/fct/egr/d/ridgefield-construction-engineers/6978388472.html", "text": "Construction engineers", "compensation": "Compensation will vary by project", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nEngineer required to review construction plans for various restaurant fit outs. After review of CAD plans, stamp for submission to city building departments in Connecticut and New York    "]},
{"date": "2019-09-13 11:20", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-estimator-for-city-projects/6977770166.html", "text": "Estimator for city projects", "compensation": "paid per project", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nRMZ CONTRACTING company is seeking senior and junior estimators to join our family. Compensation commensurate with experience. Below are some of the skills required; although character, willingness to learn and work hard will be considered.", "\n• Review construction drawings & specifications, conduct field visits and gather all material and data necessary to determine scope of work and organize a construction cost estimate.", "\n• Prepare detailed cost estimates for residential, commercial and institutional projects, utilizing Sage Timberline Estimating software.", "\n• Prepare and organize material takeoffs utilizing On-Screen Take Off (OST) software for accuracy and seamless transition to Project Management Team.", "\n• Ability to create project schedules/timelines utilizing MS Project software.", "\n• Establish job costs through analysis of vendors/sub-contractor quotations for material/services.", "\n• Develop the scope of work for sub-contractors and assist account executive in preparation of buy-out package.", "\n• Maintain digital file of working documents as back-up for estimating database, including quotations and notes.", "\n", "\nDesired Skills And Experience", "\n", "\nMUST", "\n• Strong understanding of the NYC Construction environment as applied to urban exterior restoration and general knowledge of the estimating process, including blueprint and specification reading, as well as material and labor costs.", "\n• Proficiency in rigging requirements and experience in exterior masonry, roofing, flatwork/garage and historic preservation.", "\n• Outstanding organizational skills. Must possess a structured, logical, and methodical approach to problem solving. Must be able to meet deadlines and manage time effectively.", "\n• Excellent communication and interpersonal skills.", "\n• Must be able to effectively work with production team, from Project Managers to office staff to sub-contractors. Must be effective in directing and supporting the work of others.", "\n• Outstanding attention to detail. Ability to effectively recognize issues and discrepancies in bid documentation.", "\nPLUS", "\n", "\nKnowledge of MS Project, On-Screen Take Off, SAGE Timberline Estimating Extended and AutoCAD software.", "\n• Bachelor's degree in architecture, engineering or related discipline, or equivalent combination of technical training and experience.", "\n• At least five (5) years' experience in New york city projects Construction Estimating with a proven track record of accuracy, efficiency, and profitability.", "\n    "]},
{"date": "2019-09-13 13:24", "link": "https://newyork.craigslist.org/brk/egr/d/drafters-for-direct-hire-position/6977890471.html", "text": "Drafters for direct hire position - Bilingual Russian", "compensation": "Based on experience.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPosition available now. We are seeking a draftsperson/project manager to work full-time in the office located in Brooklyn, preferably bilingual, (Russian).", "\nManage project quality by providing ideas and suggestions aimed at improving effectiveness of the project/department. Strong understanding of the NYC Building Codes is crucial, however, we provide training. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. Able to work efficiently in tight deadlines, ever-changing team-oriented environment. Must be able to communicate effectively both orally and in writing with team members and outside professionals while proactively communicating with the Project Manager to obtain needed information to continue progress on plans. Site visits may be required depending on the projects.", "\nExperience with renderings (particularly 3D Max) is a plus. However training will be provided. Salary based on skill and experience. ", "\nPlease include resume and portfolio/samples that reflect your creativity.", "\n    "]},
{"date": "2019-09-13 13:27", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-structural-engineer-position/6977893247.html", "text": "Structural engineer position available.", "compensation": "Based on Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nStructural engineer position available.", "\nArchitectural Consulting Company is looking for a full time structural engineer which will work with planning and development of structural drawings, specifications for new and renovation of existing facilities, perform site visits, assisting a senior staff member in the completion of day to day projects. Strong understanding of NYC Building code is required however training will be provided. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. ", "\nPlease include resume and portfolio.", "\n    "]},
{"date": "2019-09-11 13:20", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-fall-internship/6976396605.html", "text": "Architectural Fall Internship – Student or Recent Graduate", "compensation": "One time -Stipend: - $1,400 Full Time / $1,100.00 Part Time", "employment_type": "employee's choice", "images": [], "description": ["\n        ", "\nKushner Studios is an award-winning architecture & interior design firm. Our current projects include high-end residential & commercial projects, with a fast-growing reputation as the \"Go to\" firm for breweries and restaurant design. (www.kushnerstudios.com) (", ")", "\nThe internship program at Kushner Studios aims to provide aspiring architects/interior designers/artists/ with little, or no professional background and still attending a relevant university program, or recent graduates the opportunity to gain real-world experience in a multifaceted architectural firm.", "\n", "\nDescription and Responsibilities\u2028", "\nWorking in a creative, fast past paced and professional setting, the internship training provides the chance to apply the knowledge gained in an educational environment to the many diverse tasks typically found in a design-build business. Interns will be considered part of the learning team, responsible for supporting project managers, they will be asked to perform a variety of tasks under the direct observation and/or supervision of a Kushner Studios employee, some with specific deadlines that are crucial to the project.", "\n", "\nOur office is unique in several aspects: the most obvious is our facility and organization, both broadminded and broadly presented approach to project management & construction; With design projects that span Residential, Commercial, Hospitality and Institutional, we hope this internship finds much applicability in your future careers.", "\n", "\nRequirements\u2028", "\nCandidates currently enrolled in or recently graduated from an accredited architectural program must be enthusiastic and motivated with a working knowledge of Word and Excel, rendering skills in Vector works or AutoCAD a plus.", "\n", "\nRemuneration: One time -Stipend: - $1,400 Full Time / $1,100.00 Part Time", "\nHours per Week: - Minimum 18 hrs (Part Time) - 28hrs (Full Time)\u2028", "\nEmployment Start Date: - September 16th, 2019 or as soon as possible.", "\nEmployment End Date: 12 weeks\u2028- 15 weeks ", "\nEnrolled in or recently graduated from an accredited architectural program.", "\n", "\nApplication Instructions:", "\nEmail Resume, Portfolio, and cover letter.  Files larger than 5MB will not be considered.    "]},
{"date": "2019-09-13 14:25", "link": "https://newyork.craigslist.org/que/egr/d/draftsman-assistant-project-manager/6977950839.html", "text": "Draftsman, Assistant Project Manager", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nA reputable Architectural Woodworking Company is looking for a full time draftsman/assistant project manager position. Only solid, professional and long term oriented please apply. This position requires excellent knowledge of AUTOCAD. Only experienced in the field apply. Please email your resume, references and salary expectations    "]},
{"date": "2019-09-11 11:38", "link": "https://newyork.craigslist.org/mnh/egr/d/architectural-model-shop-manager/6976297796.html", "text": "Architectural Model Shop Manager", "compensation": "$6,000 / month", "employment_type": "contract", "images": [], "description": ["\n        ", "\nWe are searching for a skilled architectural model maker to manage our model shop and oversee several projects. We employ the use of a laser cutter and 3d printer.", "\n", "\nExpected employment duration: Through November 2019 with the possibility for other work beyond.", "\n", "\nBWArchitects is a multi-disciplinary firm that specializes is high end residential, hospitality and special events. Our projects are based in NYC, California and Europe. We are a design and detail oriented firm with a rigorous approach to our work. Our clients are important and so are our families.", "\n", "\nCheck out the WORKSHOP section on our website: www.bw-architects.com", "\n", "\nIf interested, please email us your resume and samples of relevant experience, technical knowledge and the dates when you are available to start work.    "]},
{"date": "2019-09-11 19:42", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-seeking-junior-to-intermediate/6976711289.html", "text": "Seeking Junior to Intermediate Architect” / Architectural Designer", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSeeking Junior to Intermediate Architect” / Architectural Designer", "\n", "\nNA Design Studio is a small and dynamic design firm based in Brooklyn working on a wide range of high end projects including multi-family residential, offices and institutional buildings. We take pride in our designs and collaborate in an energetic studio environment and incorporate a systematic, yet open minded approach with all of our projects. ", "\n", "\nWe are seeking a full time “Junior to intermediate architect” that has extreme passion for both the design and technical aspects of Architecture to work closely with project leadership and design team in an energetic collaborative environment. This team position offers great opportunities with long term growth potential, working directly with the principal on projects from design to construction with responsibilities to include: ", "\n", "\nResponsibilities:", "\n", "\nDevelop projects from schematic-design, design development, construction documents to construction coordination", "\nDevelop design concepts, sketches, layouts and design presentations", "\nManage workflow of projects, organize and maintain records. ", "\nDevelop construction documents from design drawings and under supervision of senior staff", "\nResearch, analyze and implement zoning and building code requirements", "\nCoordinate and develop details based on construction documents", "\nCoordinate throughout the DOB plan examination process to coordinate approvals.", "\nConstruction site visits to review progress as well as to create as-built plans and drawings.", "\n", "\nQualifications:", "\n", "\nArchitectural degree required (B. Arch or M. Arch)", "\nGood understanding of construction documents is a must, with a minimum of 4 years of construction document development and coordination experience.", "\nHighly proficient in AutoCAD and in computers in general. Architectural desktop experience a plus, and other industry accepted software also desired", "\nExcellent communication skills, verbally and in writing is a must, with ability to communicate with clients, contractors and consultants.", "\nMust be reliable, extremely organized, resourceful, self motivated and able to work in groups or independently, with ability to multi-task and meet deadlines. ", "\nUnderstanding of building construction, zoning and building code ", "\n3D modeling and rendering, photoshop and graphic presentations skills a plus", "\n", "\n", "\nThanks in advance to those who apply for taking the time to share your work with us.", "\n    "]},
{"date": "2019-09-12 17:03", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-cad-operator-drafter/6977338799.html", "text": "CAD Operator / Drafter", "compensation": "Salary based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nStructural engineering firm in Long Island City, Queens has an immediate opening for a full-time AutoCAD draftsperson.", "\n", "\nThis is NOT a telecommuting position. You must be able to come to work at our office in LIC and you must be authorized to work in the U.S. Please do not apply if you are not within commuting distance. ", "\n", "\nRequirements:", "\n• 4+ years in AutoCAD experience", "\n• Must have working experience in engineering/architectural drafting", "\n• Must be able to generate plans and sections", "\n", "\nDuties and Responsibilities:", "\n• Create detailed, accurate construction documents for structural engineering projects (commercial and residential)", "\n• Work with principal engineer to make corrections to the drawings under tight deadlines", "\n", "\nExcellent communication skills are a must.", "\n", "\nTo apply, please send resume in PDF format and email your salary requirements.", "\n    "]},
{"date": "2019-09-13 08:53", "link": "https://newyork.craigslist.org/wch/egr/d/mount-vernon-auto-cad-construction/6977658484.html", "text": "AUTO CAD / CONSTRUCTION ESTIMATOR", "compensation": "Based on Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nMidsize Construction Company seeking an Auto CAD / Construction Estimator to assist the estimating department for commercial high end projects. The estimator should have already gained 2-3 years' experience for evaluating bid specifications and drawings, ensuring that we have all necessary documents required to successfully bid the project. Estimators will also work with the Project Management teams to follow up on bids and budgets.", "\n", "\nCAD Operator/Construction Estimator exceptional capabilities to manage our key accounts and interface with suppliers, Engineers, Architects and End Users. Individual must possess exceptional communication skills, have high output and be able to multi-task in an extremely daily fast pace operation. Candidate must know AutoCAD and be proficient at reading exhaust shop drawings, NYC Building Department Codes and Practice: Energy Code, Zoning, and Building Code, Construction Document experience: Exhaust, electrical and plumbing.", "\n", "\nWe are a medium size construction firm with a wide range of projects, from finely crafted small-scale interior / exterior exhaust systems to new construction.  Self-directed individuals will find the position an exciting opportunity to grow and learn within a collaborative business environment.  ", "\n", "\nOnly candidates meeting all qualifications will be considered.", "\n", "\nRequirements and responsibilities includes, but are not limited to:", "\n-Minimum 2-3 years' experience for commercial bids", "\n-Must be able to utilize AutoCAD", "\n-Ability to read and analyze plans and specifications in full detail", "\n-Prepare bid packages and meet deadlines", "\n-Prepare and maintain status of plan reproduction", "\n-Review bid requirements thoroughly", "\n-Knowledge of MS Office and Adobe software", "\n-Positive, thorough, and proactive communication a must as there will be constant interaction with Clients, architects, and subcontractors", "\n    "]},
{"date": "2019-09-11 13:16", "link": "https://newyork.craigslist.org/que/egr/d/woodside-earn-up-to-18-hr-deliver-with/6976391620.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "employment_type": "contract", "images": [], "description": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-12 12:40", "link": "https://newyork.craigslist.org/mnh/egr/d/junior-intermediate-architectural/6977100182.html", "text": "Junior & Intermediate Architectural Designers", "compensation": "Commensurate with Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nKGA is a small, twenty-nine year old firm based in Chelsea with a wide array of projects, including commercial, institutional, multi-family residential, single-family residential, and temporary installations. Employees experience all aspects of design, from Schematics through Construction Administration.", "\n", "\nKossar + Garry Architects, LLP (KGA), is looking for a talented and creative individual to fill two Architectural Designer positions:", "\n(1) 1-2 years of U.S. experience.", "\n(1) 3 years and above of U.S. experience.", "\n", "\nRequirements:", "\n- Minimum Bachelors of Architecture.  Only applicants with Bachelors of Architecture will be considered.", "\n- Professional Revit Experience.", "\n- Strong graphic skills required, including expertise in AutoCAD, Revit, Rhino, Adobe Creative Suite, and 3D modeling software.", "\n- Ability to communicate fluently in English, verbally and in writing, with clients, consultants and contractors, is essential.", "\n- Strong multi-tasking and organizational skills are required.", "\n- Word and Excel familiarity is a plus.", "\n- Familiarity with NYC Zoning and Building Codes is a plus.", "\n", "\nPlease send your resume and work samples in PDF format, max of 5mb.", "\nInclude SALARY requirement on your cover letter.", "\n", "\n    "]},
{"date": "2019-09-13 15:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-electrical-engineer/6977996674.html", "text": "ELECTRICAL ENGINEER", "compensation": "$120,000-130,000", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nELECTRICAL ENGINEER with BSEE and 5 + years experience", "\nin commercial, residential or healthcare projects. ", "\nPermanent. Full time. Excellent benefits.", "\n", "\nHANK DEVITO", "\n", "\nEmail: Hank11214@hotmail.com", "\nTel: Juliana at 718-449-5745    "]},
{"date": "2019-09-13 14:28", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/6977953378.html", "text": "Project Manager", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an ambitious, positive and long term oriented individual with a minimum 4 years experience as a Project Manager in an Architectural Woodworking Company.", "\nRequirements: Excellent knowledge of technology and materials, work under pressure and high managerial skills. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills. ", "\nPlease email your resume, references and salary expectations.    "]},
{"date": "2019-09-08 09:17", "link": "https://newyork.craigslist.org/wch/egr/d/harrison-junior-and-intern-architect/6974014420.html", "text": "Junior and Intern Architect", "compensation": "Salary will be directly related to ability and performance.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nJunior and Intern Level Architect", "\nHarrison, New York ", "\nSmall Architectural firm seeking to fill positions for full-time and part time Junior Architect / Intern. Work directly under licensed professional. Contribute to residential, commercial, and industrial projects. The right candidate should be hard working willing to learn the field of architecture, and reliant.  Great experience for candidate who is working toward or possess a bachelor in Architecture with some prior experience. The office is in Harrison NY four blocks from train station.", "\n", "\nWe seek motivated, bright, and responsible individuals with:", "\n• Strong communications skills", "\n• Working towards or possess a bachelor degree in Architecture", "\n• Detail oriented and organized", "\n• Ability to work independently", "\n• Willing to learn", "\n• Skilled in Collaboration and able to take Direction from the Team", "\nSoftware Requirements: ", "\n• AutoCAD 2014 a must", "\n• Sketchup", "\n• Microsoft Office", "\n• Photoshop a plus", "\n", "\nInterested candidates should e-mail a cover letter, work examples and resume. Resumes must include a phone number and the city/town of residence. ", "\nCompensation: Salary will be directly related to ability and performance. ", "\nEmployment type: Full-time & Part-time", "\n", "\n    "]},
{"date": "2019-09-13 14:26", "link": "https://newyork.craigslist.org/que/egr/d/estimator/6977952038.html", "text": "Estimator", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an experienced, ambitious, positive and long term oriented individual.", "\nRequirements:", "\nExcellent knowledge of wood technology and materials. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills.", "\nExcellent working conditions, atmosphere, pay and benefits.", "\nPlease email your resume, references and salary requirements.", "\nOnly candidates from woodworking industry please apply.    "]},
{"date": "2019-08-19 11:40", "link": "https://newyork.craigslist.org/que/egr/d/forest-hills-civil-field-engineer/6959915282.html", "text": "Civil Field Engineer", "compensation": "Dependent on skills & experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nTectonic is currently seeking full-time Civil Field Engineers to work on various building and infrastructure projects throughout the NYC area. ", "\n", "\nThis position will provide Civil Field Engineers with the chance to work on high profile, challenging projects that offer the opportunity for professional growth and advancement within the A/E/C industry working for a Top ENR 500 Firm. ", "\n", "\nESSENTIAL FUNCTIONS", "\n", "\nThe essential functions of this position include traveling to various project sites on a daily basis, monitoring construction operations, and using applicable field testing procedures and testing equipment to perform required field and building inspections and testing, as well as all related testing as required by the project and client to determine compliance with project plans and specifications. Essential functions also include the preparation of Daily Field Reports, communication of deficiencies observed in the field to project managers, contractors, and/or client representatives, and the interpretation of project-related drawings and documents, as well as all other duties as assigned.", "\n", "\nQUALIFICATIONS", "\n", "\n•\tBS Degree in Civil Engineering;", "\n•\tRegistered EIT in New York State;", "\n•\tRelated certifications are a plus;", "\n•\tAbility to complete OSHA 10-Hour Construction Safety and Health Training within a reasonable time period;", "\n•\tEffective oral and written communication skills; ", "\n•\tAbility to learn and understand the fundamentals of building inspection codes and requirements in order to carry out testing, including, but not limited to, International Building Codes, ASTM Standards, and TMS standards; ", "\n•\tMust be detail oriented;", "\n•\tMay also require valid, clean driver’s license and personal vehicle to travel to and transport testing equipment to various project sites primarily throughout the New York City metro area, as regular daily travel is required.", "\n", "\nTO VIIEW AND APPLY, PLEASE VISIT: ", "\n", "\nIn addition to providing competitive salaries, Tectonic offers a wide range of benefit options, including:", "\n", "\n•\tComprehensive group medical insurance, including health, dental, vision and life", "\n•\tOpportunities for professional growth and advancement", "\n•\tTuition reimbursement", "\n•\tPaid time off, including vacation, sick and personal", "\n•\tCompany–observed paid holidays", "\n•\tShort and long-term disability coverage", "\n•\tFlexible spending accounts for medical expenses and dependent care", "\n•\tCommuter benefit plan for public transportation costs", "\n•\t401K retirement and profit sharing plan.", "\n", "\nWe are an equal opportunity/affirmative action employer, and highly encourage resumes from all interested parties including women, minorities, veterans and persons with disabilities. All qualified applicants will be afforded equal employment opportunities without discrimination on the basis of race, creed, color, national origin, sex, age, disability, marital status, or any other protected class.", "\nTectonic participates in the USCIS E-Verify Program to verify that all new hires are authorized to work in the United States.", "\n", "\n    "]},
{"date": "2019-08-19 12:45", "link": "https://newyork.craigslist.org/brk/egr/d/drafter-position-bilingual-russian/6959982012.html", "text": "Drafter Position - Bilingual Russian", "compensation": "Pay based on experience.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPosition available now. Architectural Consulting Company is looking for an experienced drafter/ junior architect to work full-time in the office located in Brooklyn, preferably bilingual in Russian, literacy is not required.", "\nOur drafters work directly with the clients from the design phase to sign-off. Strong understanding of the NYC Building Codes is crucial, however, we provide training. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. Able to work efficiently in tight deadlines, ever-changing team-oriented environment. Must be able to communicate effectively both orally and in writing with team members and outside professionals while proactively communicating with the Project Manager to obtain needed information to continue progress on plans.", "\nExperience with renderings (particularly 3D Max) is a plus. However training will be provided. Salary based on skill and experience. ", "\n", "\nPlease include resume and portfolio/samples that reflect your creativity.    "]},
{"date": "2019-08-19 15:14", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-ground-up-construction/6960129731.html", "text": "Ground Up Construction Supervisor", "compensation": "1", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSahara Contracting in Brooklyn seeks qualified Construction Supervisor.  ", "\n", "\nKey Requirements:", "\n", "\nA positive attitude and willingness to encourage co-workers", "\nExcellent communications skills", "\nMinimum of 7-10 years experience in general construction", "\nExperience in supervising construction projects", "\nThe ability to set priorities and exercise flexibility where necessary", "\nAbility to read and understand blueprints, schematics, and construction documents", "\nUnderstanding of proper safety procedures and recognition of hazards", "\nResponsibilities:", "\n", "\nHiring, training and general management of all employees on the project", "\nMonitoring performance of sub-contractors and staff", "\nMonitoring project budget", "\nAccomplishing project by defining the scope and resources required", "\nAllocating resources, materials, sub-contractors and other staff", "\nMaintaining a safe, secure and healthy work environment by adhering to and enforcing safety codes", "\nTo Apply:", "\n", "\nSubmit a resume detailing your experience", "\nSubmit a cover letter explaining why you would be a great fit", "\n* You must be legal to work in the United States.", "\n", "\nContact Habeeb. 917 468 5083", "\n    "]},
{"date": "2019-08-19 18:48", "link": "https://newyork.craigslist.org/lgi/egr/d/great-neck-jr-architect-cad-draftperson/6960309483.html", "text": "Jr. Architect/CAD Draftperson", "compensation": "commensurate with experience", "employment_type": "contract", "images": [], "description": ["\n        ", "\nWe are a small architectural firm located in Great Neck, NY with easy access via public transportation. Our work includes multiple dwellings, commercial and fine residential projects in NYC and Long Island.", "\n", "\nWe are looking for a person who has 6 months - 2 years of professional experiences, and the duties include site survey, production of construction documents and client interactions.", "\n", "\nA successful candidate should have:", "\n- US Architectural Degree", "\n- CAD proficiency", "\n", "\nPlease submit a resume and a cover letter with a compensation requirement by replying to this post.", "\n", "\nwww.jwjarchi.com", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-19 11:05", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-pro-aire-design-seeks-full/6959881035.html", "text": "Pro Aire Design seeks Full Time HVAC Estimator / Estimating Assistant", "compensation": "Negotiable", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPro Aire Design is seeking a full-time HVAC Estimating Assistant ($15-22 an hour)", "\n", "\n*Please reference job title on subject, send resume in PDF, and text format on the body of email*", "\n", "\nWe are a company based in Brooklyn is looking for a HVAC Estimating Assistant with a 1-3 years' of experience in taking off a plans. Knowledge of drafting for HVAC metal shop, and coordination drawings in 2D/3D is a plus. The candidate should have knowledge of plumbing. The candidate will work in engineering department with professional. Compensation and benefits based on experience. ", "\n", "\nMAJOR FUNCTION/ROLE", "\nWill work with project managers, and mechanical engineers to take off plans, create CAD files, and construction documents for HVAC projects. Additionally, keep track of incoming/outgoing products, purchase forecast,  and return. ", "\n", "\nJOB DUTIES ", "\n• Take off plans + Performs computer-aided drafting and design work of considerable complexity. Incumbents at this level can work from verbal or written specifications. ", "\n• Create 2D and 3D models using AutoCAD MEP", "\n• Prepare HVAC Shops, As-Builts and Coordination drawings ", "\n", "\nEDUCATION AND EXPERIENCE ", "\n• High school diploma (or equivalent) plus two years related experience; OR ", "\n• An Associate Degree in a related technical field plus one years related experience;", "\n• Must have at least 1-3 years of experience in taking off plans and HVAC CAD preparation of Construction Documents, with additional experience preferred. ", "\n", "\nPro Aire Design Offers: ", "\n• Competitive wages", "\n• Medical benefits", "\n• Paid vacation", "\n• Paid holidays", "\n• Employee product discounts", "\n", "\nWe are an Equal Opportunity Employer; all qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, among other things, or status as a qualified individual with a disability. If our company sounds like a place you want to be a part of please feel free to send your resume along with any inquiries. We look forward to hearing from you!    "]},
{"date": "2019-08-19 17:42", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-estimator-full/6960259427.html", "text": "Construction Estimator - Full time", "compensation": "TBD", "employment_type": "full-time", "images": ["https://images.craigslist.org/01414_6WPrBMd4KCs_1200x900.jpg"], "description": ["\n        ", "\nEstablished NYC based Construction firm seeks self-motivated energetic individual with experience to join our team. ", "\n", "\nDuties Include: Preparing detailed take-offs and estimates, analyzing architectural & structure drawings, preparing formal proposals, cost control. ", "\n", "\nCandidate must have thorough knowledge of computer programs especially Excel, Word, Planswift and strong analytical and communication skills with an eye for detail", "\n    "]},
{"date": "2019-08-20 09:47", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-job-captain/6960595389.html", "text": "Architectural Job Captain", "compensation": "salary commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSBLM New York office looks for a highly motivated Job Captain who is a team player with excellent REVIT skills. Ideal candidate will be a well-organized, detail-oriented individual who is accustomed to working on and leading the production of multiple projects. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3+ years’ experience in an Architect’s office working on Commercial/Retail projects", "\nMust be proficient in Revit and other applicable industry software is a must", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary and benefits package commensurate with the level of experience and a creative and innovative work environment.", "\n•\tOur benefit package includes Medical/Dental/Vision Insurance, 401k Retirement Plan, Flexible Spending Plans, Paid Time Off, Holidays, and more.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational programs.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Job Captain in the subject. No phone calls, please. ", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-20 14:41", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-senior-interior-designer/6960867621.html", "text": "Senior Interior Designer/Project Manager - Home Studios", "compensation": "COMPETITIVE SALARY/MEDICAL/DENTAL/VISION", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nHome Studios (homestudios.nyc) is currently hiring a Senior Interior Designer/Project Manager to work with our design team. Home Studios is an interior design studio focusing primarily on hospitality projects. As a studio, we are inspired by detail, materials, history, and building processes. We are a young firm that is quickly growing so opportunities are vast for the right applicant. Applicants must be passionate and collaboratively-inclined.", "\n", "\nSCOPE OF WORK:", "\n", "\n-MANAGE LARGE SCALE PROJECTS ", "\n-PROJECT POINT OF CONTACT FOR SELECT PROJECTS", "\n-CREATE DESIGN WITH DESIGN DIRECTOR", "\n-OVERSEE DESIGN TEAM, SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGNERS", "\n-INITIAL APPROVAL ON ALL DELIVERABLES FOR SELECT PROJECTS", "\n-SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGN DIRECTOR", "\n-COORDINATION WITH ARCHITECT AND CONTRACTOR", "\n-CREATE SCHEMATIC PLANS, MODEL, ID SET AND CUSTOM DRAWINGS", "\n-DESIGN ITERATION FOR APPROVAL OF DESIGN DIRECTOR", "\n-BUILD SCHEDULE WITH PROJECT MANAGER", "\n-DIGITAL MATERIAL INPUT FOR RENDERINGS", "\n-DESIGN PROCESSES, PROCEDURES, AND DELIVERABLES", "\n-CONSTRUCTION ADMINISTRATION", "\n", "\n", "\nRequirements: ", "\n4-6 years of relevant experience ", "\nHighly motivated and passionate about design and/or architecture ", "\nARCHITECTURE OR INTERIOR ARCHITECTURE BACKGROUND PREFERRED ", "\nExtremely organized and detail oriented ", "\nProblem solver ", "\nTeam player and enjoy working collaboratively ", "\nHave construction knowledge or enthusiasm for learning about construction and building methods", "\n", "\nSoftware requirements (highly proficient): AutoCad, Sketchup, Adobe Creative Suite, Google Docs (Sheets)", "\n", "\nPlease send the following to careers@homestudios.nyc:", "\nShort paragraph on your background, interests, and goals", "\nResume - attachments only", "\nPortfolio - attachments only", "\nInstagram/blog", "\n3 Professional references", "\nWho is your favorite designer and why?", "\n", "\nNOTE: International candidates must hold a valid US working permit.", "\n    "]},
{"date": "2019-08-20 17:43", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-cad-account-manager/6961026493.html", "text": "CAD Account Manager", "compensation": "$50,000-$55,000 per year, Unlimited Vacation Time, Flexible Schedules, Food and Social Activities for the Team", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nRDM (a Building Engines company,) helps asset managers, landlords, and brokers capture the full potential value and rental revenue of commercial real estate. Our pioneering best-in-class solutions set the standard for more accurate measurement, understanding, visualization and redrawing of office space – without expensive CAD drawings. Now that we’ve joined forces with market-leading Building Engines, we are poised for exciting new opportunities.", "\n", "\nKey Responsibilities & Job Requirements", "\n", "\n- Use AutoCAD and our proprietary software to help customers keep their database updated with current floor plans", "\n- Serve as primary point of contact for customers and fulfill their support requests that may include: floor plan scenarios, floor plan changes, leasing/marketing plans, space analysis, space calculations based on REBNY or BOMA", "\n- Become an expert in RealAccess and clearly communicate the benefits and features", "\n- Become an expert in REBNY and BOMA methods of measurement", "\n- Attend customer training and on-boarding meetings in-person and through video", "\n", "\n", "\nRequired Skills and Experience", "\n", "\n- 2-4 years of AutoCAD experience", "\n- BA, BS Degree, or related certification and work experience using AutoCad", "\n- Experience with additional drafting software is a plus", "\n- Intelligent, motivated and competitive with a roll-up-the-sleeves and get the job done attitude", "\n- Excellent communication and interpersonal skills", "\n- Excellent organizational, prioritization, and time management skills", "\n- Knowledge of the commercial real estate space is a plus, but not required", "\n", "\n", "\nAbout Building Engines", "\n", "\nBuilding Engines is a leading cloud-based provider of property management software for operations-minded teams at commercial office, retail, and industrial real estate properties. Our web and mobile platform seamlessly connects property teams with the activities, data, and insights they need to improve operational efficiency, mitigate risk, improve tenant satisfaction and engagement, and make more informed decisions. Clients of Building Engines include many of the leading public REITs, private owner/managers, and third-party management firms in the United States and Canada.", "\n", "\n    "]},
{"date": "2019-08-19 20:10", "link": "https://newyork.craigslist.org/lgi/egr/d/smithtown-product-engineer-repair-and/6960362300.html", "text": "Product Engineer - Repair and Development", "compensation": "Up to US$0.00 per year", "employment_type": null, "images": [], "description": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-08-21 11:21", "link": "https://newyork.craigslist.org/que/egr/d/great-neck-architect-draftsperson/6961433183.html", "text": "ARCHITECT/DRAFTSPERSON - INTERMEDIATE", "compensation": "Negotiable-based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nQueens / Great Neck Architectural firm seeking Intermediate Architect with 2-5 years’ experience in new construction for high end custom one family residences, builders’ cluster residential developments, apartment buildings and commercial projects located in New York City (primarily Queens) and Nassau County.", "\n", "\nIndividual MUST have a Bachelor's degree (or higher) in ARCHITECTURE.", "\n", "\nMUST HAVE EXPERIENCE IN ONE FAMILY FRAME HOUSES.", "\n", "\nIndividual must possess excellent communication skills, be motivated, have a good sense of design and be able to produce design and construction drawings using AutoCAD. Individual must be able to work in the USA.", "\n", "\nKnowledge of New York City Zoning and Building Code and Expediting a plus.", "\n", "\nGreat opportunity to become a Registered Architect.", "\nFriendly, upbeat work environment. Send cover letter with resume and SALARY REQUIREMENTS.    "]},
{"date": "2019-08-20 21:12", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-cadd-revit-draftsperson-job/6961157781.html", "text": "CADD/REVIT DRAFTSPERSON/JOB CAPTAIN", "compensation": "to be determined", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBOUTIQUE MIDTOWN ARCHITECTURAL FIRM SEEKING CADD/REVIT DRAFTSPERSON/JOB CAPTAIN WITH 2-6 YEARS EXPERIENCE IN CORPORATE INTERIORS, BUILDING RENOVATION, AND CORE & SHELL WORK. CANDIDATE MUST BE SELF MOTIVATED AND BE ABLE TO HIT THE GROUND RUNNING. WILL BE WORKING DIRECTLY WITH PARTNER AND PROJECT MANAGER. NEED TO BE ABLE TO CREATE FULL SETS OF CONSTRUCTION DOCUMENTS, CREATE WALL TYPES, DOOR SCHEDULES, DETAILS, ETC. MUST BE PROFICIENT IN AUTOCAD AND HAVE A GOOD KNOWLEDGE OF REVIT. EMAIL RESUME AND SALARY REQUIREMENTS.    "]},
{"date": "2019-08-21 08:02", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-construction-super-assist-project/6961300928.html", "text": "Construction Super / Assist. Project Manager", "compensation": "Based on Compatibility and Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nConstruction Super / Assist. Project manager wanted with plan and spec. experience for a large Healthcare Facility renovation in East Kingsbridge.", "\n", "\nMust be able to read and understand construction drawings.  Previous commercial construction experience required.", "\n", "\nOSHA 30 hour training required. We will assist with this if you are interested and do not have the training.", "\n", "\nCandidates should be hard-working, motivated, and looking to excel.", "\n", "\nCandidate will work directly with owners, professionals, executives, superintendents, subcontractors and officials to insure that all project directives are met.", "\n", "\nResponsibilities Include:", "\n-\tManage and supervise on site construction, subcontractors and vendors ", "\n-\tComplete and submit all field required reports and logs including daily logs, subcontractor change orders, RFI's and project progress / schedules updates ", "\n-\tEvaluate plans, specifications and related construction documents for construct-ability and provide recommendations for value engineering", "\n-\tCommunicate design or material delivery issues to insure no impact to schedule or cost and report significant project related issues to project leadership in a timely manner", "\n-\tEnsure all safety and environmental requirements are met and obtain all project related permits and licenses from Authorities Having Jurisdiction ", "\n-\tImplement on site quality control and adherence to plans and specifications", "\n-\tReview and approve subcontractor and vendor pay requisitions and submit for final approval ", "\n-\tSchedule delivery and sequence of project materials and work ", "\n-\tHold weekly site meeting for subcontractors and clients and communicate the schedule to subcontractors and vendors ", "\n-\tEnsure regular communications with owners, subcontractors, and vendors", "\n-\tPlay key role in internal preparation and project debriefs", "\n", "\nPlease include the statement 'General Liability and Workman's Compensation' in your response to this posting.", "\n    "]},
{"date": "2019-08-21 12:33", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-mechanical-engineer/6961501244.html", "text": "Mechanical Engineer", "compensation": "Experienced highly compensated", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nEME Consulting Engineering Group, LLC, (EME) is a professional engineering firm, headquartered in New York City, with a satellite office in Albany, NY.  EME clients include healthcare, educational, governmental, and hospitality. EME’s core business is engineering and architectural design involving with the upgrade and enhancement of energy systems.  ", "\n", "\nEME is currently seeking degreed Mechanical Engineers for project management and engineering design.  The ideal candidate will have a degree in Mechanical Engineering and at least 3 years of mechanical system design experience in healthcare and or educational facilities.  The candidate should also have working knowledge with the following:", "\n", "\n•\tExperience with NYC Building Codes and International Building Codes ", "\n•\tHVAC design from conceptual through construction", "\n•\tExperience in water and air side systems ", "\n•\tHeating and cooling load calculations", "\n•\tEquipment selection ", "\n•\tBuilding automaton control diagrams and sequence of operations", "\n•\tWritten specifications", "\n•\tAutoCAD, Carrier HAP/Trane Trace and MS Office applications", "\n•\tKnowledge of sustainable design practices", "\n•\tStrong communication skills for client interface", "\n•\tLeadership ability to guide support staff", "\n", "\nThis position offers a competitive compensation and with bonus potential.   Benefits include multiple health insurance plans to choose from, a 401k profit sharing plan, and professional workplace environment.", "\n", "\nThese positions are permanent and offer opportunity for advancement. You will be working directly alongside a distinguished team of licensed professionals in a team-oriented environment.  ", "\n", "\nEME is an equal opportunity employer.", "\n", "\nPlease forward cover letter with resume and salary requirements.", "\n", "\n    "]},
{"date": "2019-08-21 16:57", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-finance-office-manager-wanted/6961744708.html", "text": "Finance / office manager wanted", "compensation": "Based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nGrowing construction company specializing in public works is looking to add an finance / office manager. Ideal candidate will have experience in construction and previous extensive exposure to QuickBooks and financial operations. Must be able to work in a fast-paced, pressure environment - especially during summer months. This is a permanent position with an immediate start.", "\n", "\nPlease submit resume and salary requirements. Candidates without Quickbooks experience are not considered.    "]},
{"date": "2019-08-22 10:37", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-field-service-engineer/6962143315.html", "text": "Field Service Engineer", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nJob Description", "\n", "\nOne of the 3D Printing leading companies in the United States is currently seeking a responsible, professional and experienced 3D Printing Field Service Technician.", "\n", "\nThe 3D Printing Field Service Technician ensures optimum operational performance for hardware related to 3D Printers installed at the customers' site. They deliver technical service to customers including installation, relocation, repair, and preventative maintenance. This person will provide technical and operational support of 3D printing equipment and systems located within the following types of environments: business/corporate, educational and military specifications.", "\n", "\nResponsibilities:", "\n•\tEnsure optimum operational performance for systems installed at the customer's site", "\n•\tOptimize system performance to minimize equipment downtime and ensure maximum overall customer ", "\n        satisfaction", "\n•\tBe dispatched and directed by their supervisor with a primary function of repairing customer's equipment", "\n•\tFrequent travel to perform onsite equipment installs, maintenance, and upgrades", "\n•\tFamiliarize customer with product usage and care", "\n•\tAvailability for occasional off-hours calls and work", "\n•\tRead and interpret documents such as safety rules, operating and maintenance instructions, wiring ", "\n        diagrams, flowcharts, and procedure manuals", "\n•\tWrite routine reports and correspondence", "\n", "\nEducation & Training Requirements:", "\n•\tAA degree, a two-year diploma from a technical school or military ratings such as Naval ET, FC or FT ", "\n        required", "\n•\t3-5 years of related electrical, mechanical &/or technical experience.", "\n•\tBS in engineering field preferred but not required", "\n•\tSolid knowledge of remote support tools, TCP/IP protocol, and computer science", "\n•\tSolid skills in Microsoft Office and strong troubleshooting skills with mechanical/electrical systems.", "\n", "\nRequirements:", "\n•\tMust have a hands-on approach", "\n•\tAbility to read an electrical schematic and mechanical drawings", "\n•\tStrong customer service experience required", "\n•\tSkills in organization, problem-solving, and customer relations", "\n•\tBasic interpersonal and communication skills in the business environment and a commitment to ", "\n        professionally represent the company with its customers", "\n•\tAbility to speak effectively before customers and act in an advisory capacity", "\n•\tWorking effectively and efficiently under tight deadlines", "\n•\tAbility to work at customer locations independently with minimal support", "\n•\tMust have a driver's license", "\n", "\nBenefits:", "\nExcellent employee environment with a competitive benefits package including:", "\n•\tSalary commensurate with experience", "\n•\tGreat Benefits package including Health Insurance + 401k", "\n•\tStable company with growing revenue", "\n•\tWork with cutting edge technologies in many spaces", "\n", "\nEEO/AA/V/D/M/F/SO", "\nJob Type: Full-time", "\n    "]},
{"date": "2019-08-22 12:11", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-entry-level-electrical/6962227574.html", "text": "Entry Level Electrical Engineering", "compensation": "Salary commensurate with experience, 401(K), Health & Life Insurance, Vacation Days, Sick Days", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nHighland Associates is a full service architectural, engineering and interior design firm, offering a single source of responsibility for all design and project administration disciplines.  Staff performs: architecture; interior design; facility master planning and programming; HVAC, electrical, plumbing, fire protection, and structural engineering; project management; code analysis, site utilization/selection and real estate services.", "\n", "\nCurrently hiring Entry Level Electrical Engineering to be trained in design of electrical systems for commercial and institutional facilities (new construction, renovation, fit-up and rehabilitation projects, high rise buildings), including, but not limited to: power distribution systems, emergency power generation and uninterruptible power systems, electrical system trouble shooting, lighting control systems; building and site infrastructure upgrades.  Must be proficient in electric circuit and systems design.  Must have knowledge of AutoCAD.  BSEE required.  (No computer majors)", "\n    "]},
{"date": "2019-08-22 14:25", "link": "https://newyork.craigslist.org/que/egr/d/manhasset-kitchen-bath-designer/6962353116.html", "text": "Kitchen & Bath Designer - Experienced", "compensation": "Salary + Commission", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nHi-end Kitchen & Bath Showroom/Contractor seeking experienced, talented Kitchen & Bath designer/sales person to join our team! Must be bilingual - Fluent in English and Chinese. ", "\n", "\nSkills", "\n\tCreative kitchen & bath designer (CKD, CBD a plus)", "\n\tWorking knowledge of kitchen and bath remodeling process.", "\n\tAbility to execute the contract from concept to completion. ", "\n\tKnowledge of electrical & plumbing requirements ", "\n\tProficient in Auto Cad, Excel, Word", "\n\tUnderstanding of the luxury K&B cabinetry market", "\n\tAbility to sell to high end clients ", "\n\tKnowledge of sales techniques including closing ", "\n\tWorking knowledge of current kitchen & bath design trends.", "\n\tJobsite Experience (measuring, layouts, general understanding of residential custom home construction process, etc.) plus ability to do accurate measurement for material orders.", "\n\tProven ability to work both independently and in a team environment", "\n\tDetailed oriented", "\n\tOrganized ", "\n\tInsure customer satisfaction as if you were on the receiving end.", "\n", "\nJob Functions", "\n\tResponsible for selling, designing & developing residential Kitchen & Bath Designs and guide client selections", "\n\tPrepare complete design of kitchen & bath projects, including floor plan, elevations and complete detailed drawings for installers so they have a clear understanding of scope of work.", "\n\tInclude electrical & plumbing requirements in design ", "\n\tComplete Client Information Form", "\n\tComplete all designs necessary for the owner's projects.", "\n\tProvide great customer service to clients", "\n\tAsk clients for referrals & testimonials at the completion of the project", "\n\tAttend factory training & new product launches", "\n\tEngage and develop new business opportunities through prospecting, social and professional networking    "]},
{"date": "2019-08-23 11:38", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-assistant-pm-expediter/6962927023.html", "text": "Assistant Pm Expediter", "compensation": "Salary and Benifits", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nArchitectural/Expediting firm seeking individual with MIN 3-5 year experience for an Assistant PM position , immediate opportunity.", "\nCandidate MUST know and be familiar with the municipal process.", "\nDOT, Meetings and permits", "\nDOB, filings, permits, AHV", "\nLMPC, filings, permits", "\nDEP filings", "\nResearch all departments", "\n", "\nKnowledge of applications, process for filings, permits, variances, and violation work a must.", "\nThis is a full time position with benefits, health, PTO, Vacation, 401K.", "\n", "\nPlease submit your resume  by e-mail with salary requirements.", "\nThese two components to be provided or will not be considered.", "\n", "\n    "]},
{"date": "2019-08-23 13:48", "link": "https://newyork.craigslist.org/que/egr/d/brooklyn-architectural-construction/6963053410.html", "text": "Architectural Construction Admin/ Field Representative (18-24 months)", "compensation": "Depending on Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSenior level, onsite construction administration field representative needed for 18-24 months. Multiple projects,  predominantly in Brooklyn and S.I. NYC. Job responsibilities entail monitoring progress and quality of construction work and confirm conformance with contract documents. Respond to RFI's, participate in project meetings and prepare meeting minutes. Maintain on-site project records, process change orders and review submittals' conformance with documents as well as maintain activity logs, etc. Possibly also providing in-house support at our midtown office. Opportunity to stay on in firm after  project completion, long term growth potential.", "\n", "\nQualifications:", "\n", "\n8 years minimum, with extensive CA experience.", "\nMS Office; PDF mark ups", "\nRevit and/or AutoCAD ability required", "\nArchitectural License preferred or additional related experience necessary    "]},
{"date": "2019-08-22 17:59", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/6962530380.html", "text": "Project Manager", "compensation": "Based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nProject manager needed for drywall company based in queens.", "\nMust have experience as a project manager on drywall jobs", "\nMust be reliable, motivated and excellent organizational skills.", "\nProficient in  take off, reading plans, prepare proposals, quick books, Microsoft word and excel.", "\nMust have the ability to manage new and existing drywall construction.", "\nPlease send salary requirements with resume.", "\nThe ideal candidate must be well versed in the drywall industry", "\n    "]},
{"date": "2019-08-23 16:34", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project/6963204446.html", "text": "Facade / Building Envelope Project Architect", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/01717_80ogNvJv8B5_1200x900.jpg"], "description": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled project architect with 5-10 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-23 16:30", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6963200951.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/00M0M_hTSvAd8p6K0_1200x900.jpg"], "description": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 3 to 7 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-23 23:11", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-site-supervisor/6963436860.html", "text": "Construction Site Supervisor/Manager", "compensation": "Please respond with asking starting Salary in Oybek", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nA dynamic, growth-oriented construction company G.C. serving the NYC metro market.", "\n", "\nPOSITION SUMMARY: ", "\nSite Super with strong technical skills who can support the job and PM with expert advice about execution of all trades. Must be able to communicate with clients, as well workers. All site related coordination and scheduling.", "\n", "\nESSENTIAL ROLES and RESPONSIBILITIES", "\n•\tCareful review plans and specifications and comment", "\n•\tReview Contract and comment", "\n•\tAssist in bidding process ", "\n•\tNegotiate with vendors, suppliers, and subcontractors", "\n•\tProcurement ", "\n•\tIdentify long lead time items, order materials, protect site, layout, provide take-offs", "\n•\tOverseeing Subcontractors", "\n•\tCreation and enforcement of project schedules to facilitate on-time completion", "\n•\tCoordination of Architects and Engineers ", "\n•\tMaintain strong working relationships with all professional groups (Architects, Engineers, Clients, and Subcontractors)", "\n•\tCoordinate sign-offs and inspections, make sure all project participants are on the same page and aware of the project status and responsibilities", "\n•\tReview Maintenance of building during construction", "\n•\tDevelop Internal RFI/questions ", "\n•\tProcess change orders", "\n•\tSchedule crew and subs, review subs P.O.'s ", "\n•\tReceive and review subcontractors Daily Reports of work done and labor and material employed. ", "\n•\tMaintain daily work logs and sign in/out sheets and verify that workers have the necessary union affiliations and safety training. ", "\n•\tSupervise daily project activities including but not limited to supervision of laborers, subcontractors and vendors.", "\n•\tAssist Project Manager in reviewing and approving the Subcontractor's monthly requests for payment. ", "\n•\tConduct weekly coordination meetings and monthly safety meetings with subcontractors and prepare meeting minutes.", "\n•\tHold weekly toolbox and safety meetings", "\n•\tReview Shop Drawings and schedules, take and submit meeting minutes, suggest agenda items", "\n•\tReview site and project plan with PM, prepare job status report", "\n•\tPlan and review construction Program with Project Manager including quality control procedures, work scheduling, safety and security practices.", "\n•\tEnsure that all required permits or licenses have been obtained", "\n•\tMust have knowledge of construction safety practices, codes and related issues", "\n- Provide leadership to Site Staff and Trades", "\n- Read and completely understand Construction Docs/Specifications in their entirety", "\n- Manage Day-to-Day and weekly Site Labor/Trades work", "\n- Assist in coordination of job schedule and creating sub-contractor schedules to ensure job is completed on-time and within budget", "\n- Paperwork management to keep submittal, drawings, and other pertinent project information in order", "\n- Prepare and keep daily reports / upload job site photographs in the computer software program documenting each day's activities", "\n- Generate 2 week look ahead according to the Construction Schedule and maintaining of deadlines/milestones. Important as it may indicate potential delays of project.", "\n- Keep Record of Daily Site Labor/Trade, Hours on site and task completion", "\n- Receive and inventory deliveries (Submit Bills of Lading to PM's/APM's)", "\n- Ensure that short term project delivery/completion dates are maintained. If not then communicate with PM/APM as to why expected dates are not being met", "\n- Coordinate and communicate between trades/subcontractors to alleviate conflicts", "\n- Maintain site safety/ perform weekly toolbox talks in regards to safe working habits", "\n- Perform Quality Control on workmanship/materials/equipment", "\n- Ensure proper site housekeeping/organization is maintained", "\n- Ensure equipment/materials/fixtures are properly and securely stored to avoid damage, loss and theft", "\n- Generate/Receive emails with PM's/APM's/Trades/Subcontractors/Suppliers", "\n- Review and Approve all Trade Work Tickets if changes occur on site", "\n- Generate material lists for ordering for site labor in a timely fashion and prior to actually needing on-site to perform work.", "\n- Generate incident reports, if accident occurs and notify partners immediately", "\n", "\nJob Type: Full-time", "\n", "\nEDUCATION, EXPERIENCE AND SKILLS REQUIRED", "\nFive (5)+ years industry experience (Commercial & Residential)", "\nMust be hands on manager with excellent people skills as well as excellent written and verbal communication skills", "\nKnowledge of industry and OSHA safety requirements", "\nAble to read blueprints", "\nDaily Reports, weekly, project meetings", "\nSubcontractor day to day monitoring", "\nSubmittal process, RFI process", "\nSkilled in multi-trade understandings", "\nExcellent Computer Skills, MS Office suite of products, Dropbox, Adobe, etc.", "\nSuccessful completion of in-house training", "\nAble to work at a desk when necessary as well as strap on a tool belt when required", "\n", "\nExperience:", "\nSuperintendent: 10 years (Required)", "\nConstruction: 10 years (Required)", "\nLicense:", "\n4 Hour Scaffold (Preferred)", "\n30 Hour OSHA (Required)", "\nDriver's License (Required)", "\n", "\nPlease respond with asking starting Salary in Oybek.", "\nPrincipals only. Recruiters, please don't contact this job poster.", "\ndo NOT contact us with unsolicited services or offers    "]},
{"date": "2019-08-16 10:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-plumbing-fire-protection/6957834921.html", "text": "Plumbing/Fire Protection Engineer", "compensation": "95,000.00 to 135,000.00", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nWe are a world-class multi-disciplinary engineering consulting firm who is seeking a Plumbing/Fire Protection Engineer for our New York, NY office. ", "\n", "\nResponsibilities ", "\n", "\nOur engineers work on high quality, high-profile, national and international projects. We are currently looking for engineers who will be responsible for the systems design of commercial, institutional, healthcare, and laboratory projects.", "\n", "\nResponsibilities include:", "\n• Development of initial Pluming and Fire Protection system concepts", "\n• Design of Plumbing and Fire Protection systems", "\n• Calculation of preliminary water, gas, sanitary/sewer and storm loads for utility coordination", "\n• Develop project specifications", "\n• Survey and evaluation of existing conditions", "\n• Construction administration", "\n• Assist with Project Management", "\n• Attend client meetings ", "\n", "\nRequirements ", "\nBachelor’s degree in Mechanical, Civil or Environmental Engineering preferred. ", "\n2- 15 years’ experience designing plumbing and fire protection systems preferred. (Project experience submitted for consideration should include buildings on which you have actively participated in the project from the design phase through the final construction close-out.) ", "\nStrong working knowledge of building, plumbing, and fire codes ", "\nExcellent verbal and written communication skills ", "\nCurrent PE and LEED AP licenses/registrations are preferred. ", "\nSpecial consideration will be given to those candidates who have successfully demonstrated innovative design experience specifically related to renewable energies and sustainable, high performing buildings.", "\n", "\nOur company offers salary commensurate with experience, a comprehensive benefits package which includes medical, dental, disability and life insurances, 401k plan, tuition reimbursement, and more.    "]},
{"date": "2019-08-16 14:15", "link": "https://newyork.craigslist.org/fct/egr/d/bethel-solidworks-cad-designer/6958044666.html", "text": "Solidworks CAD Designer", "compensation": "Competitive", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSolidworks CAD Designer", "\nFocal Metals – Bethel, CT", "\n", "\nAbout Us: Focal Metals fabricates high-end, custom architectural furnishings and structural components for quality homes throughout Connecticut and New York. We proudly assist the completion of exacting home projects in some of the most unique and beautiful houses in the country. Frequent projects include the design and fabrication of kitchen hoods and counters, spiral stairs, entry doors, and railings.", "\n", "\nDuties and Responsibilities: We seek to add an additional full-time Solidworks CAD Designer to our growing team. Duties include designing and producing  shop/ build to CAD drawings of custom architectural metals goods using Solidworks  CAD software.  Interacting with general contractors, architects, designers, PM’s and company management to facilitate seamless  manufacturing and installation of the designed items.  CAD Designer must have a willingness to work in a fast pace friendly environment.", "\n", "\nREQUIRED: Knowledge of CAD design and related software.", "\n", "\nREQUIRED: At least one year of experience designing architectural metal good, architectural components or mill shop cabinetry.  ", "\n", "\nSpecial consideration will be given to applicants with experience with the Solidworks or AutoCAD software. Applicants must be available to work full-time during normal operating hours and adhere to safety standards. ", "\n", "\n    "]},
{"date": "2019-08-16 18:01", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6958237509.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/00M0M_hTSvAd8p6K0_1200x900.jpg"], "description": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 3 to 7 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-17 07:58", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-civil-structural-engineer/6958481155.html", "text": "CIVIL/STRUCTURAL ENGINEER WANTED", "compensation": "Salary commensurate with experience.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nWe are a multifaceted engineering firm located in midtown Manhattan, and we’re looking for a full-time civil/structural engineer with AutoCAD proficiency and 1-3 years of experience in design, field work, and project management. Knowledge of façade restorations a plus. Salary commensurate with experience.    "]},
{"date": "2019-08-16 18:02", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project/6958238423.html", "text": "Facade / Building Envelope Project Architect", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/01717_80ogNvJv8B5_1200x900.jpg"], "description": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled project architect with 5-10 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-19 09:44", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6959812116.html", "text": "Intermediate Architect", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nNew York based architectural firm is seeking a Intermediate Architect for current large-scale projects. Applicant must be available to begin work immediately. We are seeking a Project Architect with a minimum of 8 to 10 years of experience in the delivery of detailed construction documents. Proficiency in Autodesk Revit, AutoCad and associated software.. ", "\n", "\nApplicant must possess excellent technical skills. Applicant will be required to perform program analysis, zoning analysis, building planning standards and code compliance issues for large scale facilities is desirable. Experience with current New York City Building Code is a plus.", "\n", "\nWe offer a competitive salary and benefits package commensurate with experience, health insurance, vacation/sick time, disability and paid family leave coverages. ", "\n", "\nInterested candidates please forward a cover letter and resume.    "]},
{"date": "2019-08-18 09:37", "link": "https://newyork.craigslist.org/wch/egr/d/rye-landscape-architect-designer/6959173444.html", "text": "Landscape Architect/Designer", "compensation": "according to experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/00l0l_e0qntubOLEZ_1200x900.jpg"], "description": ["\n        ", "\nAre you ready to grow as a practitioner, be involved in all aspects of your projects, and to see them built and enhancing the lives of your clients? ", "\n", "\nWe’re doing great work, and we’re growing. Take a look at our website and see for yourself – www.sjlandscapearchitects.com ", "\n", "\nHigh-tech, innovative landscape architecture practice seeks talented, self-motivated landscape architect or designer to join our team. If you enjoy your work and can juggle varied tasks accurately and efficiently in a progressive, collaborative environment, we’d love to meet you. Here’s what you’ll need: ", "\n", "\nAutoCAD experience is required", "\n3d software experience helpful", "\nKnowledge of construction methods", "\nRegional plant knowledge", "\nPreparation of construction documents, details & presentation drawings", "\nAbility to effectively communicate with clients and a wide variety of contractors and professionals. ", "\n", "\nWe're an award-winning professional services firm producing high-end projects primarily in Metropolitan NY & CT. Our office in beautiful Rye, New York is spacious, modern & bright, close to Manhattan, major highways and walk-able from the Metro North Railroad. Submit, via email, in PDF format, a resume with cover letter, including salary requirements, references, and AutoCAD drawing samples. NO PHONE CALLS.", "\n", "\nOnly applicants meeting our criteria will be contacted as part of the short-listing process.", "\n    "]},
{"date": "2019-08-19 09:12", "link": "https://newyork.craigslist.org/lgi/egr/d/great-neck-interior-architect-designer/6959790489.html", "text": "Interior/architect  designer", "compensation": "Hourly rate", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nPinner Architecture  is currently seeking a talented, responsible, ambitious FREELANCE Senior Interior Designer for immediate part-time employment to work  on commercial Interiors designs. We are looking for a sharp individual who is detail-oriented, and who likes to experiment with new ideas and materials. The candidate must be equally able to take direction and work independently as needed while being fully accountable for all project assignments. They will also need to be team-spirited, willing not only to listen but also contribute to a creative design dialogue. Curiosity, discernment, resourcefulness, and drive are important.  Could lead to full time employment.    "]},
{"date": "2019-08-19 10:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-draftsman/6959835362.html", "text": "Junior Draftsman/Architect with Purchasing Experience", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nCommercial and residential construction company based in Manhattan seeks Junior Draftsman/Architect with purchasing experience. Excellent opportunity to gain knowledge of and practical experience in the construction industry.  Strong potential for advancement and additional responsibilities based on performance.", "\n", "\nResponsibilities, Qualifications and Required Skills: ", "\n•\tRead, interpret and prepare architectural and woodworking drawings.", "\n•\tCandidate must have strong knowledge of AutoCAD or other architectural software.", "\n•\tCandidate must be able to produce quality shop drawings for commercial and residential project.", "\n•\tSource materials and contractors for each project.", "\n•\tDevelop network of multiple material vendors and service contractors to facilitate timely construction and the highest quality standards, and to ensure costs remain within budget.", "\n•\tNegotiate pricing and delivery schedules with vendors. Expedite deliveries when necessary.", "\n•\tKnowledge and experience working with construction material vendors in NYC, a big plus.", "\n•\tMust be comfortable working in a high-pressured environment.", "\n•\tMust be self-motivated and take initiative without instructions", "\n•\tEnergetic and dynamic personality a big plus ", "\n", "\n    "]},
{"date": "2019-08-19 10:22", "link": "https://newyork.craigslist.org/wch/egr/d/white-plains-survey-crew-chief/6959842486.html", "text": "Survey Crew Chief", "compensation": "Negotiable", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nThis is an excellent opportunity with a highly-respected engineering firm as a crew chief in the survey department. This is a great role for an individual with 2-5 years of experience as a Crew Chief who might be looking to work for a more reputable firm, or someone with experience as a Land Surveyor looking for their first Crew Chief role. ", "\n", "\nCandidates will be responsible for operating survey equipment, reporting data to office personnel, and leading a small team. Outstanding candidates will also have experience using Robotic Total Station Equipment. ", "\n", "\nRequirements:", "\nAt least 2-5 years of experience in land surveying", "\nOSHA 10 Certification (we can help obtain)", "\nReferences from past employers", "\n", "\nIf you are interested in the opportunity, please attach an updated resume.    "]},
{"date": "2019-08-24 11:02", "link": "https://newyork.craigslist.org/que/egr/d/bayside-architect-senior-intermediate/6963626629.html", "text": "ARCHITECT Senior/ Intermediate/ Junior", "compensation": "$20-$30 based on experience/knowledge", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nMin. proven 3 year architectural drawing experience ", "\nDrawings using autocad,", "\nUnderstanding NYC zoning regulation/ bldg code, ", "\nPermit applications and other required forms.", "\n", "\nLegal documents for employment in US.", "\nBA/BS in Architecture required.", "\n", "\nEnglish Communication skill req'd.", "\nFull time, Cover letter with Expected Salary.    "]},
{"date": "2019-08-26 10:23", "link": "https://newyork.craigslist.org/fct/egr/d/fairfield-project-engineer-fairfield/6964885260.html", "text": "Project Engineer (Fairfield)", "compensation": "Based on Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBaggage Handling Systems design consulting firm has an immediate need for a Project Engineer in our Connecticut office. ", "\n", "\nOur firm, BNP Associates, Inc. specializes in the design of automated baggage handling and screening, parcel, cargo and apron systems for airports throughout the world. We are the market leader in all of these fields and our employees are respected industry leaders. We are seeking the best of the best to help us grow and excel.", "\n", "\nMechanical engineering, architectural engineering, or a construction management background is preferred, however, civil, industrial and electrical engineers may be considered with relevant knowledge or experience. ", "\n", "\nBNP Associates, Inc. specializes in the design of automated baggage handling and screening, parcel, cargo and apron systems for airports throughout the world. The position will be based out of our Fairfield, CT office; however, travel will be required so the ability and willingness to do so is a must. ", "\n", "\nThis engineering position will provide the successful candidate with a broad array of opportunities to utilize their talents. We are seeking an individual who has considerable attention to detail and will contribute to our team of airport system consultants in project roles from the preparation of design and specification documents, cost estimating, project management through on-site installation and commissioning efforts. Excellent written and verbal communication skills are required. We utilize the latest software package technology in our design efforts, including recent releases of AutoCAD, Revit, AutoMod, PathPlanner, and Microsoft Office suite of programs, so experience in any of these would be beneficial.", "\n", "\nWe are looking for a local candidate, and as such, no relocation package is being offered for this position. ", "\n", "\nProjects that the successful candidate will participate in will require federal background checks and drug screening. We are an equal opportunity employer. We offer an excellent benefits package and competitive salaries, along with professional advancement opportunities. ", "\n", "\nIf you are seeking a rewarding career that provides you the opportunity to become a significant contributor in the fast paced, dynamic environment of airport systems design, please send your cover letter, resume, and a list of references to bnphq@bnpassociates.com", "\n    "]},
{"date": "2019-08-26 11:25", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-manager-for-busy/6964940143.html", "text": "Project Manager for Busy Design-to-Build Reno Co.", "compensation": "75k-125k DOE", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBusy Design-to Build renovation company looking for mid to upper level project manager.", "\nMUST be able to oversee jobs throughout NYC, supervise, and report to CEO.", "\nMUST have experience performing alterations in Co-ops, Condos, and houses.", "\nMUST be college grad.", "\nAble to start immediately.    "]},
{"date": "2019-08-26 16:46", "link": "https://newyork.craigslist.org/que/egr/d/astoria-mid-level-architect-8-to-10/6965250255.html", "text": "Mid-Level Architect: 8 to 10 Years of Experience", "compensation": "Competitive", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSeeking Mid-Level Architect with 8+ years of experience in all phases of design including Schematic Design, Design Development, Construction Documents and a strong background in Construction Administration. The candidate should have the following:", "\n", "\n•\tMust have strong background in Construction Administration", "\n•\tAbility to independently review submittals, respond to RFIs, and issue bulletins", "\n•\tLicensure in New York State is preferred", "\n•\tBachelor’s or Master’s degree in Architecture", "\n•\tProficiency in AutoCAD 2014 or later with BIM experience a plus", "\n•\tAbility to coordinate the work of a multi-disciplinary team", "\n•\tSelf-motivation and the ability to work independently", "\n•\tExperience with Microsoft Office (Word, Excel, PowerPoint) and other graphic / design software including the Adobe Design Suite", "\n", "\nPreferred project experience includes K-12 schools, higher-education projects, and design of large-scale public projects (transit stations, convention centers, and similar).", "\n", "\nExperience and interest in sustainable design/documentation and LEED is strongly encouraged, with applicable accreditations preferred.", "\n", "\nFor application requirements and submission instructions, see the link below:", "\n", "\n", "\n", "\ndi Domenico + Partners, LLP is an equal opportunity employer. The firm offers a full benefits package including health insurance, dental and vision insurance, and 401(k) retirement plan.", "\n    "]},
{"date": "2019-08-26 23:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-dob-filing-representative/6965492876.html", "text": "DOB Filing Representative- Freelance", "compensation": "TBD", "employment_type": "contract", "images": [], "description": ["\n        ", "\nJob Description", "\nFiling Representative needed to file DOB Architectural filing set and certificate of correction in Manhattan NY.", "\n", "\nMust have Class 1 or 2 Filing Representative License.", "\n", "\nRESPONSIBILITIES:", "\n", "\nDOB (Department of Buildings)", "\n", "\n1. Pre-filing and E-filing for job filings (ALT 1, 2, 3, Demo, PA)", "\n2. DOB Now Build", "\n3. DOB Now Safety", "\n4. DOB Now Inspections:", "\nSchedule Construction, Plumbing, Electrical inspections", "\nDelegate pertinent parties", "\nDownload Pass - Final Reports and submit for sign-off", "\nUpload corrections for certifiable objections", "\n5. DOB Permits PW 1, PW 2, PW 3, PW4, After hour variances", "\n6. Site Safety Plans", "\n7. Records Room research: microfilm, block and lot, folder", "\n8. Post Approval Amendments", "\n9. Violations (AEU2, AEU20, Dismissals, Waivers)", "\n10. Stop Work Orders, Partial Stop Work Orders", "\n11. Obtain New DOB Tracking Number for Contractors and insurance updates", "\n12. Required Items submission", "\n13. Letter of Completions", "\n14. Temporary and Final Certificates of Occupancy", "\n15. Schedule and attend Plan Examiner appointments to obtain approvals", "\n16. Attend Chief Plan's examiners meetings with Architects, Engineers, Developers, Property Managers", "\n17. Attend meetings with Deputy Borough Commissioners", "\nDOT (Department of Transportation)", "\n", "\n1. DOT Permits: Sidewalk, Fire Hydrant, Curb Cut", "\nECB (Environmental Control Board)", "\n1. Attend ECB hearings", "\n2. Process penalty payments", "\n", "\nTOPO (Topographical Bureau)", "\n", "\n1. Street Address Verification", "\nDOF (Department of Finance)", "\n", "\n1. Tax Maps", "\n", "\nFDNY (Fire Department of the city of New York)", "\n", "\n1. Submit applications", "\n2. Obtain Building Profiles, Notices of Violation and Violation Orders", "\n3. Attend appointments", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-26 14:45", "link": "https://newyork.craigslist.org/brk/egr/d/architectural-intern-administrative/6965140411.html", "text": "Architectural Intern / Administrative assistant", "compensation": "Competitive compensation based on skills/experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBrooklyn Architectural firm seeks:", "\nfull-time position for Architectural Intern / Administrative assistant", "\n", "\n", "\nSkills: ", "\nProfessional & motivated attitude", "\nWritten and communication skills ", "\nStandard Microsoft office suite familiarity", "\nArchitectural background", "\nFamiliarity with NYC Department of Buildings", "\n", "\nResponsibilities include:", "\nWritten reports / Paperwork ", "\nClient correspondence, etc.", "\n", "\nCompetitive compensation based on skills/experience", "\n", "\nJob seeker to live within 20 miles of 11219 Zip code.    "]},
{"date": "2019-08-26 23:42", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-nyc-dob-architect/6965495303.html", "text": "NYC DOB_ Architect _ Architectural Services- filing set_ Freelancer", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nArchitectural Services- filing set_ Architect_ Freelancer\\Independent Contractor", "\n", "\nWe are seeking an Architectural Associate/CAD drafter to create NYC DOB filing sets for commercial renovations, specifically Restaurant projects primarily in Manhattan.", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n", "\nPosition is an independent contractor/ freelancer    "]},
{"date": "2019-08-27 11:34", "link": "https://newyork.craigslist.org/brk/egr/d/junior-intermediate-architect-expediter/6965717468.html", "text": "Junior / Intermediate Architect / Expediter", "compensation": ".", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nArchitectural/design firm is looking for a Junior / Intermediate Architect for full time position.  The firm specializes in Commercial, Mid sized residential buildings and in high-end residential single family homes. We are very detail oriented and work with a select few clientele base.", "\nCandidate should possess the following qualifications:", "\nMust be proficient in AutoCad, have good verbal skills, be a team player and be willing to work on projects from inception to completion.  ", "\n", "\nPosition:", "\nApplicant will be working on all phases of a project from the design phase through the production of a complete set of construction documents/construction administration under the direct supervision of the Architect. Our belief is to expose individuals to all aspects of architecture as to increase their worth and knowledge within the firm.    "]},
{"date": "2019-08-27 11:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect/6965730490.html", "text": "Architect", "compensation": "open - depending of experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nArchitect ", "\n", "\nEME Consulting Engineering Group (EME)—one of New York City’s leading professional firms dedicated to energy efficiency, existing building design and sustainability—is seeking a degreed architect with 1–3 years of experience providing architectural design service for fit-out and modifications to existing spaces for EME’s educational and healthcare clients. ", "\n", "\nThe position of Associate Architect will work alongside experienced senior architects providing support in design and field applications. Highly motivated individual with a strong work ethic and commitment to work in a team environment in the office as well as in the field. EME’s core business is the implementation of energy efficiency systems in existing buildings.  ", "\n", "\n•\tExperience with ADA and accessibility design requirements", "\n•\tKnowledge of NYC Building Code ", "\n•\tKnowledge of construction drawings and specifications", "\n•\tProficiency with AutoCAD and rendering tools", "\n", "\nThe position will provide considerable exposure to clients and requires excellent communication and project management skills. The position offers significant opportunity for advancement within EME's growing in-house architecture department. ", "\n", "\nEME is an equal opportunity employer, offering competitive salaries with a full benefits package. ", "\n", "\nFor immediate consideration, please email a cover letter, resume, and salary requirements", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-27 13:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-jr-associate-architect8-month/6965811746.html", "text": "Jr. Associate Architect.....8 month project....NYC", "compensation": "28.00 - 35.00 per hour", "employment_type": "contract", "images": [], "description": ["\n        ", "\nAssociate Architect must have a minimum of five (5) years of experience. The ideal candidate will have an Architectural degree, and experience with government projects, especially in K-12 public schools and public housing. Knowledge of interior building surfaces and materials.  He or she will have experience with building condition assessments inspections and generating computer-based reports.    "]},
{"date": "2019-08-27 17:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/6966054359.html", "text": "Project Architect", "compensation": "DOE", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSmall Manhattan design driven architectural firm is seeking a highly motivated Architect / Project Manager to assist with multiple projects, including new construction and gut renovations for commercial and residential projects.", "\n", "\nQualifications:", "\n-\tArchitecture degree required", "\n-\tMust have minimum  of 10 years experience in U.S. based offices", "\n-\tExperience with code research, zoning research and product research", "\n-\tCoordination of Architectural and Engineering Documents", "\n-\tConsultant Coordination", "\n-\tDesigning, drawing, and development of Architectural Plans, Elevations, and Details", "\n-\tExperience doing field surveys and as-built drawings", "\n-\tKnowledge of Mechanical, Electrical, and Plumbing Systems", "\n-\tTime Management and organizational skills", "\n-\tExcellent written and communication", "\n-\tProficient in AutoCAD, Microsoft Office, and Adobe", "\n", "\nPlease Provide resume, portfolio, and salary requirements.", "\n    "]},
{"date": "2019-08-28 11:47", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/6966474737.html", "text": "Project Architect", "compensation": "Salary commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nGF55 Partners in New York City is looking to hire a Senior Project Architect to work on significant large scale Mixed Use Multi Family Projects in the New York region. The candidate should capable of running a team and interacting with clients and consultants. The work is fast paced, challenging and rewarding.  Our Midtown office provides a collaborative environment with interaction between the senior and junior staff. Our dynamic pipeline of work provides opportunities for true achievement. ", "\n  ", "\nPersonal development is encouraged, and professional growth is supported.  ", "\nCompetitive compensation and benefits provided commensurate with qualifications and experience.", "\n", "\nMinimum requirements:", "\n7-10 years of relevant experience", "\nProfessional Degree ", "\nProficient in Revit, AutoCAD, Bluebeam and Microsoft Office.", "\nLicensed Architects preferred.", "\n ", "\nPlease email your cover letter, resume, and samples of work. ", "\n", "\n    "]},
{"date": "2019-08-27 21:23", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-interior-design/6966186464.html", "text": "Architect/Interior Design Internship/Full Time Position", "compensation": "Competitive Salary, Insurance and Bonuses", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBoutique Architecture and Interior Design firm specializing in high end residential projects looking to fill two positions.  Both Junior Designer and Administrative Assistant will work directly with the principals and can expect to participate in all aspects of the design process from concept to completion.  Both positions require individuals with outstanding personal and professional demeanor and communication skills.  Ideally, the Junior Designer has a Bachelor's Degree in Interior Design / Architecture and 1 - 2 years of professional experience.  AutoCad / Rendering skills are a must.   Our Administrative Assistant should have a minimum 1 -2 years relevant professional experience and thorough knowledge of QuickBooks.  Non-smokers only.  Dog lovers preferred.", "\n", "\nPlease send resume and salary requirements.    "]},
{"date": "2019-08-28 11:22", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6966451697.html", "text": "Intermediate Architect", "compensation": "Competitive Salary", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nGF55 Partners (www.GF55.com) seeks a talented and motivated full time Intermediate Architect for its NYC Office. Enjoy a stimulating and challenging team work environment with a variety of significant projects.  The position requires strong design, analytical and communication skills to interact with colleagues, clients and consultants.  GF55 offers an environment where professional growth and development is encouraged.", "\nGF55 seeks excellence by a collaborative search for the best solution in the creation of architecture ", "\n", "\nSkills Required ", "\n•\tRevit, Cad, Sketchup, Photoshop, In Design and MS Office Suite", "\n•\tStrong Analytical skills, and good follow through ", "\n•\tAbility to collaborate and work independently ", "\n•\tBachelor's Degree in Architecture or higher", "\n•\tAuthorized to work in the US", "\n•\t1-3 years of relevant experience ", "\n", "\nCompensation commensurate with qualifications. GF55 pays a competitive salary with benefits. ", "\n", "\nInclude in your application:", "\n•\tCover Letter", "\n•\tResume ", "\n•\tWork Samples", "\n    "]},
{"date": "2019-08-28 11:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect/6966462955.html", "text": "Architect", "compensation": "$40,000 - $70,000 (Depending On Experience)", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nArchitect", "\n", "\nSmall Manhattan Design Firm Seeks Architect with 3 - 5 Years Experience in High End Residential (Apartments and Townhouses). License not required", "\n", "\nThe position of Architect will work alongside experienced senior architects providing support in design and field applications. Highly motivated individual with a strong work ethic and commitment to work in a team environment in the office as well as in the field. ", "\n", "\n• Experience with townhouse design ", "\n• Knowledge of NYC Building Code and Landmarks requirement", "\n• Knowledge of construction drawings and specifications", "\n• Proficiency with vectorworks design program (6 months minimum) and Mac computers", "\n", "\nThe position will provide considerable exposure to clients and requires excellent communication and project management skills. ", "\n", "\nWilliam Leeds Architect is an equal opportunity employer and offers competitive salaries.", "\n", "\nFor immediate consideration, please email a cover letter, resume, and salary requirements", "\n    "]},
{"date": "2019-08-28 12:25", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6966509540.html", "text": "Intermediate Architect", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nNew York based architectural firm is seeking Intermediate Architects for current large-scale projects. Applicants must be available to begin work immediately. We are seeking Project Architects with a minimum of 8 to 10 years of experience in the delivery of detailed construction documents. Proficiency in Autodesk Revit, AutoCad and associated software is required. ", "\n", "\nApplicants must possess excellent technical skills. Applicants will be required to prepare detailed construction document's, attend site meetings and prepare field reports. Experience with current New York City Building Codes.", "\n", "\nWe offer a competitive salary and benefits package commensurate with experience, health insurance, vacation/sick time, disability and paid family leave coverages. ", "\n", "\nInterested candidates please forward a cover letter and resume.    "]},
{"date": "2019-08-28 13:17", "link": "https://newyork.craigslist.org/que/egr/d/construction-estimator/6966558357.html", "text": "Construction Estimator", "compensation": "Competitive salary", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nConstruction Estimator/Project Manager", "\n", "\nEstablished NYC based Construction firm seeks self-motivated energetic individual with minimum 10 years' experience to join our team.  ", "\n", "\nDuties Include: Preparing detailed take-offs and estimates, analyzing architectural drawings, developing scope of work, preparing formal proposals, attend meetings and walk throughs, solicit bids from subcontractors and vendors, manage projects, cost control, submittals and scheduling. ", "\n", "\nCandidate must have thorough knowledge of computer programs especially Excel, Word, Planswift and MS Project and possess strong analytical and communication skills with an eye for detail.", "\n", "\nBA/BS in architecture or engineering preferred.  Drawing, sketching and Auto CAD proficiency a plus.", "\n", "\nCompetitive salary and benefits package.", "\n    "]},
{"date": "2019-08-28 13:58", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-engineer-hotel/6966596105.html", "text": "ENGINEER (Hotel)", "compensation": "Competitive Package", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nWe are in search of a savvy, hands-on individual that can work independently.  Join our Team at the Residence Inn and Courtyard by Marriott Central Park, an Interstate Hotels and Resorts property.", "\n", "\nYou’re like the firefighter of Engineering. You’re always at the ready and first to respond when something goes wrong. You understand the urgency because guests expect and deserve a safe, comfortable environment and associate safety is critical. You’re alert and action-minded, with the technical skills and know-how to keep operations smoothly running. If this rings true, Interstate’s Class II Engineer position may be the perfect opportunity for you.", "\nAs an Engineer, you will", "\no\tBe ready and quick with your knowledge and experience to ensure guest safety and comfort, and a safe environment that’s critical to fellow associates.", "\no\tBe on top of preventive maintenance to protect every aspect of the property, from hotel rooms and equipment to kitchen and laundry.", "\no\tKeep operations running smoothly in the absence of engineering staff.", "\no\tRespond swiftly and effectively to every emergency situation that arises during your shift.", "\no\tHelp keep the mechanical areas safe, orderly, and clean and maintain legible, orderly records.", "\n", "\nFundamentals", "\nA high school diploma with special instruction in building maintenance and construction, having two years building experience in building maintenance or related industry, is required. The ability to maintain and repair HVAC, electrical, plumbing equipment and perform carpentry, repair work, construction and renovation work is expected. This position requires carrying a radio while on duty and may require operating a pick-up truck and snow removal equipment. You must have effective communication skills and a professional manner. This position requires complete mobility and the ability to lift at least 40 pounds.", "\n    "]},
{"date": "2019-08-28 15:03", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-architecture-work/6966654844.html", "text": "Part-time architecture work- must know Revit", "compensation": "TBD", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nSmall architecture firm looking for part-time, freelance employee for immediate hire. Must know Revit. All levels of experience are welcome. Working on small projects, renovations, and small new buildings. Send hourly rate, resume, and a few work samples. Find us at jorgefontan.com    "]},
{"date": "2019-08-29 17:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-class-2-expeditor/6967499998.html", "text": "Class 2 Expeditor", "compensation": "Based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSeeking class 2 licensed expeditor. Established firm, great location. Responsible, punctual, and effective. Salary negotiable based on experience.    "]},
{"date": "2019-08-28 17:48", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-special-inspector-concrete/6966790395.html", "text": "Special Inspector (Concrete)", "compensation": "Competitive compensation based on skills/experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBrooklyn based Class 1 special inspection firm seeking a Special Inspector.", "\n", "\nJOB FUNCTIONS", "\nThis position will be responsible for performing or witnessing special inspections on New York City construction projects, including mid to high rise buildings.", "\n", "\nCandidate will be required to prepare reports on inspection activities, file documentation and complete required technical report forms in accordance with New York City Construction Codes.", "\n", "\nQUALIFICATIONS:", "\nMust have \"ACI Concrete field testing technician\" certification.", "\n", "\nMust have one of the following certifications;", "\n-ICC reinforced concrete special inspector", "\nor", "\n-ACI concrete construction special inspector", "\n", "\nStrong oral and written communication skills; ability to communicate in English. Follow directions, and interpret engineering and construction plans.    "]},
{"date": "2019-08-29 07:39", "link": "https://newyork.craigslist.org/mnh/egr/d/autocad-pm-drafting-positions-for-site/6967040035.html", "text": "AutoCAD PM/Drafting Positions for Site Safety Plans", "compensation": "We offer a competitive salary (commensurate with experience), with paid vacation", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPM/Drafting position - Safety design coordinator for a Major NYC Safety Consulting Company", "\nWe are looking for a full-time CAD PM/Draftsman to join our dynamic Production team. As a member of this fast-paced, cutting edge group you will work with architects, engineers and construction specialists to handle the drawing and graphic needs for industry leading developers and construction managers.", "\n", "\nKey Duties and Responsibilities:", "\nThe Safety Design Coordinator will work in a team overseeing project design, construction & project administration. ", "\n", "\nKnowledgeable of codes and regulations including NYC Building Code, NYC Fire Code & DOT regulations.", "\n", "\nProficient in reviewing DOB-BEST Squad objections and maintaining Building Code, the client's preferences, and design intent.", "\n", "\nMeet with New York City Department of Buildings Plan Examiners to review and obtain approvals of Site Safety Plans.", "\n", "\nGood drafting skills. Must be able to balance CAD drafting (For Site Safety Logistics Plans for Alterations, Facade Repairs & New Buildings), project management and coordination. ", "\n", "\nPerform Quality Assurance reviews of drawing sets.", "\n", "\nConduct site visits for field measurements and drawing research.", "\n", "\nDevelop and produce presentation materials, including plans, diagrams, details, etc", "\n", "\nCommunicate and follow up with clients about specific projects and their goals.", "\n", "\nPrepare daily & weekly reports.", "\n", "\n", "\n", "\nQualifications:", "\n1.\tBachelors Degree in Architecture, Civil engineering or closely related field preferred.", "\n2.\t2-5 years architectural design/CAD drafting work experience, minimum 1 year in Project Coordination, or Management.", "\n3.\tMust have EXCELLENT computer skills. Proficient in CAD software and/or AutoCAD experience is required. ", "\n        REVIT knowledge is a plus. Proficiency in Photoshop and/or illustrator, PowerPoint, Excel and Word is necessary as well.", "\n4.     Complex problem solving and decision-making skills.", "\n5.\tGood written and verbal communication skills", "\n6.\tMust be a team player and have the ability to effectively multi-task", "\n7.     Strong leadership, communication and relationship management skills.", "\n8.     Flexibility in a fast-paced changing environment. ", "\n9.     Working knowledge of NYC Building Code, Chapter 33 Safeguards During Construction or   Demolition as well as OSHA ", "\n        CFR 1926 Construction Safety and Health and NYC DOT", "\n", "\nWe offer a competitive salary (commensurate with experience), with paid vacation and benefits package.", "\nRecent college grads welcome to apply!", "\n    "]},
{"date": "2019-08-29 13:17", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect-commercial/6967270722.html", "text": "Project Architect | Commercial Architecture", "compensation": "Temporary to hire position. Hourly fee initially, then full time base salary, PTO plus full benefits package if hired.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nTitle:", "\nProject Architect for Commercial Projects", "\n", "\nPosition Overview:", "\nQuality control, design oversight, coordination of all project disciplines, scheduling, budgeting, ensure code compliance.", "\n", "\nRequirements:", "\nProfessional degree in Architecture from an accredited university. ", "\n7-15 years of professional experience.", "\nRevit proficiency.", "\nProject leadership experience.", "\nExperience working on commercial projects.", "\n ", "\n    "]},
{"date": "2019-08-29 13:32", "link": "https://newyork.craigslist.org/fct/egr/d/landscape-designer-architect-landscape/6967283957.html", "text": "Landscape Designer/Architect - Landscape sales", "compensation": "Based on experience and skill. Excellent benefit program", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nElise Landscape Design Group", "\n", "\nLandscape Sales professional and landscape designer/architect to join our team. We design and build creative, integrated landscape plans for high-end residential clients.", "\n", "\nCandidates should have a proven record in residential landscape sales with the ability to present and communicate to a sophisticated client base. Autocad or equivalent software abilities a plus. Designing and selling landscapes with style for the high-end residential market key!", "\nApplicants with a landscape design background and exterior design are appropriate for this position.", "\n", "\nYou'll find us in New Canaan in an attractive work environment with an exceptional benefits, salary and retirement package.", "\n", "\nInterested candidates should forward resumes and letter of interest.", "\n", "\nThe Elise Design Group and Elise Landscapes & Nursery is an established award winning Landscape Design and Build firm serving the greater Fairfield and Westchester County areas. Our company provides high quality, innovative landscape design, construction and maintenance services as well as retailing landscape plantings, unique garden elements and furnishings.", "\n", "\nPosition Requirements:", "\nMinimum of 5 years, high-end residential landscape sales experience", "\nDegree in Landscape Design/Architecture/interior design preferred", "\nThe ability to present and communicate design concepts clearly to a sophisticated client base.", "\nProficiency with landscape design software and related office software", "\nGeneral knowledge of permitting and zoning processes", "\nDesire to grow professionally", "\n", "\n    "]},
{"date": "2019-08-28 15:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-solar-project-manager/6966681883.html", "text": "Solar Project Manager", "compensation": "Salary plus package includes 100% company medical insurance, and paid time off for holidays, vacations and sickness.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nCome join one of the fastest growing Electrical Contractors in the New York area.  We offer great benefits, and career growth opportunity for the right candidate.", "\n ", "\nElectrical firm taking on a huge Solar Project, various locations across the state, seeks qualified PM to assist in managing numerous  projects.", "\nIn this role you will prepare work and manage crews for the installation of Solar energy.", "\n ", "\nREQUIREMENTS – If you are the ideal candidate, you will have:", "\n* Must have solar experience PV", "\n* Familiarity with New York City and New Jersey union labor rates", "\n* An understanding of construction and ability to visualize the requirements", "\n* An orderly mind with a tendency to be careful and accurate", "\n* Decisiveness and the ability to make decisions without being intimidated by detail", "\n* Fairness, honesty, and integrity", "\n* Patience to finish the project without frustration", "\n ", "\nRESPONSIBILITIES", "\n* Reading & understanding of bid documents: drawings, specifications & scope of work", "\n* Evaluating which materials and methods will be used on Solar jobs", "\n* Obtaining price quotes of equipment from various suppliers and analyzing the cost-effectiveness and specification compliance", "\n* Contributing to the team effort by accomplishing related results as needed", "\n", "\n    "]},
{"date": "2019-08-29 18:11", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/6967512467.html", "text": "Project Architect(s)", "compensation": "Commensurate with Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nMssa, a Small Successful 9-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "]},
{"date": "2019-08-30 10:24", "link": "https://newyork.craigslist.org/lgi/egr/d/roslyn-heights-carpet-flooring-sales/6967824079.html", "text": "Carpet & Flooring Sales/Estimator", "compensation": "Based on Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nEstablished Flooring Company located in long island is currently seeking a full-time Carpet & Flooring Sales/Estimator with a construction background.    "]},
{"date": "2019-08-29 19:20", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-ecb-vioaltion-and-demolitions/6967556941.html", "text": "ECB/Vioaltion and Demolitions expediter", "compensation": "Let me know how much you would like and show me what you can do.  VIOLATIONS AND DEMOS lets roll!", "employment_type": "employee's choice", "images": [], "description": ["\n        ", "\nHello, I have a small/midish size office and looking to add to the team. I need an expediter who HAS KNOWLEDGE AND EXPERIENCE with ECB/FDNY/DOT violations.   You need to be able to work independently to make your own Certificate of corrections and attend court.  You will be responsible to follow up and organize your violations.  You have to be able to argue violations based on issuance and merit in court. ", "\n", "\nThe second part of your job is Demolitions.  I need you to deal with Demolitions including cutoffs, ordering pest control, submit plans to Best, organizing with the Engineer of record.  And occasionally dealing with Best regarding Stop work Orders. ", "\n", "\nIf you want to work and know how to work our team is looking for someone.  Please contact me. Position is only for work described above. All other positions are filled I need violations and Demolitions. I am not willing to teach I need someone who can handle the work.   We have the best laid back and fun office in the industry but you need to come in knowing this work I will not train but I will guide and offer full support staff. PART TIME CAN work as well. ", "\n", "\n    "]},
{"date": "2019-08-30 18:23", "link": "https://newyork.craigslist.org/que/egr/d/architect-cad-drafting/6968226007.html", "text": "Architect CAD Drafting", "compensation": "Based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBusy Queens Architectural firm [www.ArchitectsStudioNY.com] seeking an Intermediate CAD Draftsperson with project mgmt duties for new mid-rise Residential/Commercial base buildings, alterations and Interior Renovation projects. ", "\n", "\nThe  individual will work directly with the Principal Architect to manage and administer each phase of the project, and coordinate incoming and outgoing information on a day-to day basis. ", "\n", "\nQualifications:", "\n-Knowledge in Construction Details", "\n-Knowledge of NYC Building Codes, NYC Zoning Ordinances", "\n-Full engagement of projects", "\n-Knowledge of NYC Zoning Resolution, NYC Building Codes, ADA Regulations", "\n-Able to work under pressure to meet deadlines", "\n-Primarily an office-based position but some travel required for project meeting and other related duties", "\n-Proficient drafting skills using AutoCAD, including layer management", "\n-Minimum 3 years of construction technical work experience ", "\n", "\n", "\nIdeal candidates are those looking for growth through long-term employment and must be able to work overtime when required. Company offers health insurance benefits and 401K participation opportunity.  ", "\n", "\nEmail cover letter  and resume [in pdf format] with desired compensation to us with confidence. Any other format will not be viewed.  Please indicate CAD under subject line on email.", "\n", "\n    "]},
{"date": "2019-08-30 14:55", "link": "https://newyork.craigslist.org/que/egr/d/queens-village-gc-construction/6968064520.html", "text": "GC Construction Assistant Project Manager", "compensation": "$21.00 per hour", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nA Queens Village-based mid-size General Contracting & Construction company specializing in remodeling residential homes is currently seeking a full-time Assistant Project Manager (APM) with experience in residential projects. The APM will work closely with a Project Manager handling anywhere from 3 to 5 projects at a given time. The APM should have high energy, demonstrate enthusiasm, sensible to time constraints and the ability to work with demanding architects and clients.", "\n", "\nJob responsibilities include, but are not limited to:", "\n-Attending weekly site meetings", "\n-Creating meeting minutes, daily logs, change orders, and requisitions", "\n-Coordinating client/architect meetings", "\n-Assisting PM to fall within project schedule and budget", "\n-Handling all RFIs and RFPs, submittals, and shop drawings", "\n-Handling project closeouts and punch list items", "\n-Processing paperwork for the NYC Dept. of Buildings ", "\n-Strong written/verbal skills", "\n", "\nAt least 2-3 years of experience. Knowledge in MS Projects, Word, Excel, and Outlook a must. Ability to read architectural plans also a must. Driver's license a plus. This position is an immediate start.", "\n    "]},
{"date": "2019-08-30 17:23", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6968185342.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/00M0M_hTSvAd8p6K0_1200x900.jpg"], "description": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-30 17:26", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/6968187363.html", "text": "Facade / Building Envelope Architect", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2 to 5 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-01 07:37", "link": "https://newyork.craigslist.org/lgi/egr/d/melville-bookkeeper/6969065658.html", "text": "BOOKKEEPER", "compensation": "Salary", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nGeneral Contracting firm is looking or a full time bookkeeper. Candidates need to have a basic knowledge of accounting and quickbooks. Bachelor's degree is a plus, 3 years experience preferably in the construction industry.", "\nTo apply please send your resume and requirements.", "\n", "\n", "\n    "]},
{"date": "2019-09-01 15:38", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-intern-mechanical-engineer/6969330022.html", "text": "Intern Mechanical Engineer", "compensation": "Market", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nOpentrons makes robots for biologists. Currently, over 90% of biologists in the world run experiments with manual pipettes, moving tiny amounts of liquid from vial to vial by hand. By making robotics affordable and open, we can help all life-scientists easily execute and share their experiments. Opentrons’ robotics are in use in over 40 countries around the world and have been adopted by top-tier institutions like Stanford, Harvard, Merck, and Roche. ", "\n", "\nWe’re interested in candidates who are working toward a BA/BS in mechanical engineering with background/experience in  the following:", "\n•\tPrototyping processes : 3D printing, Laser cut", "\n•\tDesign for production methods", "\n•\tSolidWorks", "\n•\tPassionate about products", "\n    "]},
{"date": "2019-09-01 16:52", "link": "https://newyork.craigslist.org/que/egr/d/richmond-hill-experienced-architect/6969375572.html", "text": "EXPERIENCED ARCHITECT/ DRAFTER", "compensation": "BASED ON EXPERIENCE", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nLOOKING TO HIRE EXPERIENCED ARCHITECT/ DRAFTER MUST KNOW AND BE ABLE TO DO NYC  ZONING CALCULATIONS,  CODES REVIEW  AND PLAN REQUIREMENTS FOR DOB SUBMITTAL FAMILIAR WITH  DOB PAPERWORK. CLASS TWO DOB ID IS A PLUS. ", "\n", "\nREQUIREMENTS:", "\n- Must have 5-year Bachelor of Architecture degree and minimum 3 years working experience in single family residential design and mixed-use buildings ", "\n- Must have knowledge of NYC zoning and building codes", "\n- Must be able to develop design concepts into a full set of construction drawings independently", "\n- Must be a very organized team player with excellent communication skills. Must feel comfortable/confident to be the liaison between office, clients, contractors and consultants", "\n- Strong AutoCad skills ", "\n- Must be able to manage multiple projects EMAIL YOUR RESUME.    "]},
{"date": "2019-09-02 11:45", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-jr-architect-draftsman/6969750147.html", "text": "Jr Architect / Draftsman", "compensation": "Commensurate with Experience", "employment_type": "contract", "images": [], "description": ["\n        ", "\nDesign and construction management company in midtown Manhattan is seeking an individual with the following qualifications:", "\n", "\n-  Seven to ten (7-10) years NYC experience in architectural design and drafting", "\n-  Bachelor's of Architecture degree from accredited university", "\n-  Understanding of NYC construction and zoning codes ", "\n-  Experience in latest version of Auto-CAD and related programs", "\n-  Fluency in English - written and spoken", "\n-  Promptness in delivering assigned work/projects", "\n-  US citizen or documented legal resident", "\n    "]},
{"date": "2019-09-02 13:19", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/6969829364.html", "text": "Architect/Designer", "compensation": "Compensation commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/01111_gaz8wvs7ByI_1200x900.jpg"], "description": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "]},
{"date": "2019-09-02 14:18", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-project-manager/6969878694.html", "text": "Construction Project Manager", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\n", "\nPrepare complete and detailed scopes of work for construction trades.", "\n", "\nPerform quantity take-offs with accuracy and completeness.", "\nSolicit budgets and bids from subcontractors and suppliers in a timely fashion", "\nResolves cost discrepancies by collecting and analyzing information.", "\nPrepares special reports by collecting, analyzing, and summarizing information and trends.", "\nMonitor project costs and schedule", "\nMonitor site supers and attend meetings", "\n", "\nAt least 4 years industry experience minimum", "\n", "\nPlease email resume with expected salary", "\n", "\nAlso looking for Estimators and Assistant Project managers/site supers    "]},
{"date": "2019-09-03 09:22", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-metal-drafter/6970329938.html", "text": "Architectural Metal Drafter", "compensation": "Compensation: TBD on Experience and Position", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nOur company designs and fabricates architectural metal for a variety of jobs. We are looking for experienced and motivated people to begin work immediately here at Phoenix Metal Designs.", "\n", "\nWe are looking to hire a talented Architectural Drafter with a minimum of 5-years experience for a full-time position.", "\n", "\nAn ideal candidate can perform the following tasks:", "\n", "\nAnalyze building codes, by-laws, space, site requirements, technical documents and reports to determine their effect on architectural designs.", "\n", "\nCheck dimensions of materials to be used and assign numbers to lists of materials.", "\n", "\nHave proficiency in AutoCad and AutoDesk Inventor.", "\n", "\nMake accurate shop drawings to be used for in-house fabrication.", "\n", "\nWork well and coordinate with floor manager to oversee proper fabrication of materials.", "\n", "\nCommunicate with team members and clients throughout development of projects.", "\n", "\nNote: Day to day projects may vary widely: flexibility and the ability to adapt quickly are required.", "\n", "\nRegular job hours are 7:00 AM - 4:00 PM Monday through Friday.", "\n", "\nWork will be required both in shop and in the field.", "\n", "\nCompensation: TBD on Experience and Position", "\nEmployment Type: Full-time    "]},
{"date": "2019-09-03 10:33", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-cad-drawing-design-sales/6970382326.html", "text": "CAD DRAWING /DESIGN /SALES", "compensation": "Pay according to experience.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nCAD DRAWING  STORE DESIGNER / SALES PERSON needed.", "\n", "\nCome join one of the largest store fixture companies on the east coast.", "\n", "\nUse your CAD skills to design store floorplans and custom display furniture for large retail companies.", "\n", "\nWe design pharmacies, jewelry stores, supermarkets, cigar stores, eye glass stores, and much more.", "\n", "\nWe are manufactures and make all of the  custom wood display furniture ourselves. Our factory is 100,000 square ft. in size.", "\n", "\nWe also manufacture metal shelving systems (gondola shelving) and glass cases in high volume which is very attractive to major retailers.", "\n", "\nUse your CAD skills and personality to help customers and companies design their dream store. ", "\n", "\nWe are looking for a mature person willing to go the extra mile and satisfy our customers needs.", "\n", "\nThis is an excellent chance to use your CAD skills and join a great organization.", "\n", "\nSend us your resume today to get an interview. Our office is located in Brooklyn, NY.", "\n", "\n ", "\n", "\n", "\n    "]},
{"date": "2019-09-03 10:45", "link": "https://newyork.craigslist.org/wch/egr/d/white-plains-plumbing-fire-protection/6970392823.html", "text": "Plumbing/Fire Protection Engineer", "compensation": "Commensurate with Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nProgressive engineering firm looking for Plumbing/Fire Protection Engineer (Entry level to 10 years experience).  ", "\n", "\nWe are a full service engineering firm specializing in mechanical, electrical, telecommunications, plumbing and fire protection engineering design services. ", "\n", "\nOur diverse projects are spread across all market sectors. (Corporate, Financial, Retail, Educational, Medical, Hotels, Data Centers, Industrial, etc.)", "\n", "\nOffice is located in White Plains, NY, close to Metro North train station and we also have free parking for all employees.", "\n", "\nRequirements: ", "\nAutoCad experience is a plus.", "\nBachelor’s degree in Mechanical Engineering preferred. ", "\nEntry level to 10 years’ experience designing plumbing and fire protection systems preferred.  ", "\nStrong working knowledge of building, plumbing, and fire codes ", "\nOur company offers salary commensurate with experience, a comprehensive benefits package which includes         medical, disability and life insurances, 401k plan, and PTO.    "]},
{"date": "2019-09-03 10:35", "link": "https://newyork.craigslist.org/mnh/egr/d/draftsperson-detailer/6970384489.html", "text": "Draftsperson Detailer", "compensation": "tbd", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nStore/events Display props and wood cabinetry manufacturing company seeking motivated and responsible individual to fill the position of Draftsperson Detailer. Must be experienced with the process of producing client drawings and production drawings.", "\n", "\n", "\nMust be experienced and proficient in 3D rendering.", "\n", "\nExperience in creating CNC files required. ", "\n", "\n", "\nMust also be skilled with drafting decorative patterns, intricate millwork", "\nand heavily sculpted three dimensional elements for production. ", "\n", "\n", "\n", "\nCandidate must be familiar with materials such as solid wood, plywood,", "\nplastic, metal fabrication and veneer work. ", "\n", "\n", "\nMust submit portfolio with application, no candidate without portfolio will be considered!", "\n", "\n", "\n", "\nHours are Monday through Friday 8:30 AM - 5:30 PM and must be available for overtime, working until 8:30 PM and weekends at times.", "\n•\tPrincipals only. Recruiters, please don't contact this job poster.", "\n•\tdo NOT contact us with unsolicited services or offers", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-03 16:51", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager/6970738763.html", "text": "Project Manager", "compensation": "Competitive salary and benefits", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nWe are looking for a project manager to supervise electrical subcontractors during the construction phase of the project and manage site documentation for the client. Candidate with OSHA 30 training is a plus.    "]},
{"date": "2019-09-04 08:28", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-sales-design-coordinator/6971069363.html", "text": "Sales & Design Coordinator", "compensation": "This role offers a competitive salary in addition to inclusion in the company’s profit sharing, 401K, medical, and dental programs.", "employment_type": "full-time", "images": ["https://images.craigslist.org/01515_5BTWiVU3UTl_1200x900.jpg"], "description": ["\n        ", "\nAmuneal Manufacturing Corp. has an immediate opening in our New York Showroom for a Sales & Design Coordinator.  This role will focus on our luxury furniture and architectural product offerings. This role is primarily responsible for customer support and collaboration with our Sales + Design team. ", " \n", "\nConfidence, a clean design aesthetic, the ability to spark interest in others, direct customer interaction and experience in the selling of high-end designed products are a must. Candidates must have the ability to organize their own time, multitask in a dynamic environment, be proactive, and above all else…problem solve. We are looking for someone who is eager to connect with people and translate their needs into timeless experiences and products. To be successful, candidates must have a strong interest in the creation of high-end products. Candidates must be looking for a role where they are part of a collaborative environment and able to make an impact on the organization each day.", "\n", "\n", "\n", "\n\n", "\n", "\n", "\n", "\nPlease submit both resume and cover letter for consideration.", "\n", "\n", "\n    "]},
{"date": "2019-09-05 11:14", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-project-management/6971941892.html", "text": "Architect / Project Management", "compensation": "Base compensation of 75-95K", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nAre you an Architect located in commuting distance of  New York City with hands on Revit experience? ", "\n", "\nThis is a strategic career opportunity allows you to work on world-class projects with the New York office of a highly recognized architecture and design firm.  ", "\n", "\nGeneral Overview: ", "\nMust currently reside within commuting distance of New York City.", "\nMust have working experience with New York building codes and zoning requirements.", "\nManage projects and teams. ", "\nProduce and coordinate DD and CD sets. ", "\nClient coordination. ", "\nCoordination with vendors and trades.  ", "\nQualified candidates will possess a professional degree in Architecture from an accredited university.  ", "\n", "\nResume and digital portfolio including professional Revit work samples are required for consideration. ", "\nAll communication is held in strict confidence.    "]},
{"date": "2019-09-05 09:36", "link": "https://newyork.craigslist.org/wch/egr/d/junior-intermediate-architect/6971864524.html", "text": "Junior-Intermediate Architect", "compensation": "$25-40 per hour depending on experience", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nSteven Secon Architect, a small diversified practice, is offering a part time position of approx  25-45 hours per week. MUST be proficient in Cad, sketchup, field measuring and have car. 2 year min. experience.  Bachelor of Architecture degree preferred. ", "\n", "\nSense of humor and ability to juggle several projects is essential.  Flexible schedule, strong opportunity to take on increasing responsibility, interesting variety of projects. Please send resume/samples. 30 minute cad-proficiency test given at interview.    "]},
{"date": "2019-09-04 16:36", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-intermediate-architect/6971488218.html", "text": "Intermediate Architect", "compensation": "Commensurate with Experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nAbout AMP Architecture PLLC:", "\nAMP Architecture prides itself on providing a full-service client experience. All projects, big and small, receive the same amount of expertise and attention. We believe in providing a complete architecture service: from consulting, to design, estimating and, finally, construction.", "\n", "\nThe staff at AMP Architecture is diverse in design, engineering, estimating and construction. Each of our team members bring individualized expertise within their respective backgrounds, creating an inclusive environment breeding excellence in design and construction.", "\n", "\nJob Responsibilities:", "\n- Drafting 1-4 family wood framed residential homes based off initial measurements and photos.", "\n- Completing and filing Department of Building alteration type 1,2 and 3 applications.", "\n- Assisting architects and engineers on site visits to measure and draft new projects.", "\n- Complete site visit reports with photo documentation.", "\n- Daily correspondence with team to provide updates on status of all current projects.", "\n", "\nQualifications:", "\n- 4-5 year BA in Architecture from a NAAB accredited architecture program required.", "\n- 1-2 years experience in residential wood framed construction.", "\n- Experience with filing applications with NYC DOB.", "\n- Proficiency with AutoCAD.", "\n- Strong computer skills.", "\n- Organized and able to multi-task.", "\n", "\n- Construction Management experience preferred.    "]},
{"date": "2019-09-04 21:28", "link": "https://newyork.craigslist.org/que/egr/d/flushing-structural-engineer/6971682911.html", "text": "Structural Engineer", "compensation": "The salary is based on level of experience.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nJob Description:", "\n", "\nWe are currently seeking structural engineers at multiple levels to join our team. As a structural engineer, you will work with other team members in our highly collaborative environment to assure that designs are developed in accordance with appropriate codes and standards, quality control objectives are achieved, and project goals are met within the schedule and budget. This is an outstanding opportunity for a structural engineer to work on a variety of high-profile projects throughout the region. ", "\n", "\nDuties and Responsibilities:", "\n", "\n- Coordinate with architects, contractors, owners, and other engineers from the initial planning stages through final construction.", "\n- Determine design criteria using relevant codes and standards.", "\n- Analyze and/or prepare models and calculations for various structural elements and systems by using various software and/or hand calculations.", "\n- Develop contract documents, including construction drawings and technical specifications", "\n- Produce schematic and detailed designs and evaluation of planning and concept alternatives", "\n- Review shop drawings, RFI's.", "\n- Perform field inspections and write inspection reports.", "\n", "\nSkills and Qualifications:", "\n", "\n- Familiar with latest version of AutoCAD, Revit, ETABS, SAP2000, SAFE, RAM, Excel.", "\n- Excellent verbal and written communication skills", "\n- Ability to effectively work independently and collaboratively in a team environment", "\n- Must be eligible to work in the United States", "\n", "\nEntry Level Candidates:", "\n- Bachelor’s degree in Civil or Structural Engineering.", "\n", "\nIntermediate Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 3+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n", "\nAdvance Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 8+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n- NYS PE License", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-05 09:11", "link": "https://newyork.craigslist.org/mnh/egr/d/architectural-studio-assistant-entry/6971847783.html", "text": "Architectural Studio Assistant - entry level", "compensation": "to be discussed", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nPerfect introduction to work in Architect's office for a recent grad or as a follow up to a summer internship!", "\nPrevious experience is not a requirement, just motivation to assist in a busy office and learn the rhythms of day-to-day practice.", "\n", "\nWe are a 10-ish person firm located in Chelsea, doing interesting design work for projects of all scales in nyc from New Buildings to polished interior renovations.", "\n", "\nThe position is full time and duties generally include:", "\n-assisting architects", "\n-managing the materials library", "\n-material and product research", "\n-managing images/assembling porfolio presentations", "\n-maintaining website and other media", "\n-light drafting", "\n-general studio organization", "\n-printing and reproduction", "\n-office oversight of phones, messengers, ordering supplies etc.", "\n", "\nSkillset should include:", "\n-basic photoshop ", "\n-basic autocad for printing and light drafting", "\n-microsoft office suite", "\n", "\n", "\nWe hope to cultivate young architects and there are opportunities for growth for motivated candidates.", "\nPlease forward resume / letter / a few work examples.", "\n", "\n    "]},
{"date": "2019-09-04 15:11", "link": "https://newyork.craigslist.org/que/egr/d/brooklyn-drafter/6971413917.html", "text": "Drafter", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nConstruction company specializing in Exterior Restoration will hire a draftsman. Knowledge of Autocad necessary.    "]},
{"date": "2019-09-05 11:28", "link": "https://newyork.craigslist.org/lgi/egr/d/landscape-designer-draftsperson/6971955171.html", "text": "Landscape Designer / Draftsperson", "compensation": "tbd", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nLandscape Designer/ Assistant to Principal /Drafts Person (Miller Place).  Landscape Design/Build/Furnish Firm currently seeking a qualified individual with experience in Auto Cad, SketchUp or other rendering software, Microsoft Office and Photoshop. Position available for a mature, disciplined, self motivated, honest, hard working, and committed individual.", "\nPart time independent contracting position. Flexible hours, office and field work. Competitive pay. Comfortable office setting with ability to work from home, working on exciting high-end residential landscape design / build projects. ", "\nCandidate must own their own Auto-Cad program, Lap-top and transportation. Candidate will be involved in design, construction details, estimating, field supervision and drafting. ", "\nPlease send resume and cover letter. No resumes with residency outside of Suffolk County, NY will be considered. Please have the experience and examples of design work before applying.", "\n    "]},
{"date": "2019-09-05 14:33", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-furniture-fixtures-equipment/6972128493.html", "text": "Furniture, Fixtures & Equipment Designer", "compensation": "To Be Discussed", "employment_type": "full-time", "images": ["https://images.craigslist.org/00g0g_kpFq1jBJXc0_1200x900.jpg"], "description": ["\n        ", "\nLuxury focused, international interior design firm founded in London seeks focused, resourceful and passionate mid-level FF&E designer to work closely with a team of interior designers and FF&E specialists on multiple projects in their growing New York office. ", "\n", "\nConfident, discriminating and with the ability to innovate the successful candidate for this role will possess excellent communication skills and the important ability to balance playfulness with luxury.  This role presents a wonderful opportunity to work for one of the most highly respected designers in the world on some of the most exclusive and eclectic projects anywhere.", "\n", "\n", "\nKey Responsibilities:", "\n", "\n-Be strategic and highlight important issues throughout the project phases whilst maintaining a dedication to great design", "\n", "\n-Generate control books and schedules for a wide range of items from soft home, moveable furniture and lighting to finishes, architectural accessories, hardware, decorative and fine art.", "\n", "\n-Manage several projects concurrently maintaining a calm focus and an atmosphere of productivity and accuracy even under pressure", "\n", "\n-Coordinate and maintain close relationships with all FF&E purchasing agents from research to procurement and installation", "\n", "\n-Create design concepts, presentations, resource images and draw highly detailed and complex custom furniture  ", "\n", "\n-Source a variety of unusual and custom products and samples from vendors to assist in developing unique material solutions, ironmongery, lighting and sanitary wear products", "\n ", "\n", "\n", "\nSkills and Experience:", "\n", "\n-A minimum of 3 years experience in a design position and a professional degree in interior design or furniture/industrial design", "\n", "\n-Be adaptable, creative, characterful, organized and passionate", "\n", "\n-A high level of comfort and experience making FF&E designs and using control books", "\n", "\n-A professional and warm demeanor and proficiency in delivering clear neat design presentations", "\n", "\n-Have the aptitude to work both autonomously and in teams", "\n", "\n-Demonstrate a high degree of experience with AutoCAD, Adobe Creative Suite and hand sketching", "\n", "\n", "\nFrom residences to restaurants, private members clubs and important global hotels this opportunity offers scope for great variety. With projects all over the world and an amazing reputation for exuberant and luxurious design this is an exciting opportunity to join a diverse and renowned team.  This opportunity for a discerning, thorough and multifaceted creative professional is a rare opportunity to be involved in the creation of many wonderful and celebrated projects.  Great salary and benefits for the successful candidate.    "]},
{"date": "2019-09-05 20:47", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-young-firm-is-seeking-jr/6972402118.html", "text": "Young Firm is seeking Jr. Architect – Upper East Side", "compensation": "Negotiable", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nOur Boutique firm specializes in luxury residential projects and small commercial projects. The individual selected will have the opportunity to be involved with project work on multiple building types and will work closely with our Senior Design team and Project Managers to understand and deliver on client needs. We are looking for candidates with a passion for their field and a can-do attitude, 2 to 5 years of professional architecture experience, and knowledge of sustainable building practices", "\nBenefits Package:", "\nMedical and Dental 90% Employer contribution, Paid Time Off, Aflac", "\n401 K Company Match ", "\n", "\nESSENTIAL FUNCTIONS", "\n•\tCollaborate and contribute within a multi-discipline environment", "\n•\tIntegrate architecture and engineering elements into an integrated design through the use of BIM. ", "\n•\tPreparation of contract documents and specifications", "\n•\tOccasional on-site observation of work during construction to monitor compliance with plans", "\n•\tCoordinate the arrangement of existing and proposed land features and structures", "\n•\tSelect appropriate materials for use in landscape designs", "\n•\tAnalyze environmental reports on land conditions, such as drainage and energy usage", "\n•\tAssist with activities engaged in preparing drawings and specification documents.", "\n•\tConduct periodic on-site observation of work during construction to monitor compliance with plans.", "\n•\tField surveys", "\n•\tPreparation of as-built drawings", "\n•\tPreparation of presentation drawings", "\n•\tPreparation of power point presentations", "\n•\tPreparation of construction documents", "\nQualifications and Skills", "\n•\tProficiency in Revit", "\n•\tStrong and clear communication skills", "\n•\tBasic understanding of construction means and methods", "\n•\tWillingness to learn and take direction from supervisors", "\n•\tProficiency in MS Office", "\n    "]},
{"date": "2019-09-06 07:01", "link": "https://newyork.craigslist.org/lgi/egr/d/melville-bookkeeper/6972537186.html", "text": "BOOKKEEPER", "compensation": "Salary", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nGeneral Contracting firm is looking or a full time bookkeeper. Candidates need to have a basic knowledge of accounting and quickbooks. Bachelor's degree is a plus, 3 years experience preferably in the construction industry.", "\nTo apply please send your resume and requirements.", "\n", "\n", "\n    "]},
{"date": "2019-09-06 08:51", "link": "https://newyork.craigslist.org/que/egr/d/ozone-park-structural-steel-estimator/6972573548.html", "text": "Structural Steel Estimator", "compensation": "Salary $70,000.00 annually  Paid Holiday, Sick Days and Vacation.", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nA Minimum of 3 years of experience in commercial construction structural steel as an estimator. Will prepare construction estimates, specification review, submit proposals, change orders, and coordinate project schedule.", "\n", "\n• Must be able to do a takeoff from Construction Documents and shop drawings.", "\n• Occasional travel to project sites", "\n• Reviewing customer contracts to ensure proper scope and terms", "\n• Managing and monitoring costs for work while maintaining or improving target margins", "\n• Preparation of change orders/invoices/Purchase Orders. ", "\n• Management of projects from start to finish", "\n", "\nApplicants must have excellent communication skills, the ability to work well with others, willing to learn, and a good work ethic.", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-06 11:13", "link": "https://newyork.craigslist.org/mnh/egr/d/senior-intermediate-architect/6972682127.html", "text": "Senior/intermediate Architect", "compensation": "Salary based on experience, with generous benefit package", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nMeridian Design Associates, Architects, P.C. is a medium-sized award-winning and well-published New York City-based architectural firm.  Our practice is quite varied, with both new construction and renovation/interiors, including media and entertainment facilities, corporate work, multi-family residential, and high-end residential.  We are an entrepreneurial, innovative firm which places a strong emphasis on initiative and client service.  We do a substantial number of projects outside New York City, including current jobs in Florida, Connecticut, and New Jersey.", "\nWe place a heavy emphasis on computer tools and require that our professionals have strong digital production skills, including ArchiCAD, Revit, SketchUp and other graphic software.  Presentation and 3D modeling skills are very important.  Microsoft Office (Word, Excel) is a must.", "\n", "\nWe are looking for senior to intermediate staff with 4 or more years   work experience capable of doing production, building law analysis, and design and project management.", "\n", "\nResponsibilities:", "\n•         Intensive interaction with firm principals and teams, as well as with clients, consultants and contractors.", "\n•         Design concepts presentations", "\n•         Design coordination and detailing", "\n•         Attend project meetings, take meeting notes", "\n", "\nRequirements:", "\n•         Degree in Architecture/Interior Design", "\n•         4+ years of project experience in all phases of design", "\n•         Experience in 2D/3D software, including ArchiCAD, Revit, SketchUp and other graphic software (Photoshop, InDesign). Proficiency in ArchiCAD preferred. Microsoft Office (Word, Excel) is a must.", "\n•         Strong graphic and visualization skills to communicate design presentations", "\n•         Strong leadership, communication, organizations skills and the ability to work on multiple projects at the same time.", "\n•         Knowledge of materials, construction techniques, and local building codes", "\nWe provide excellent salary and benefits.", "\n    "]},
{"date": "2019-09-06 12:22", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-architectural-civil/6972749104.html", "text": "Part time Architectural / Civil Engineering intern (NYC)", "compensation": "Commensurate with experience", "employment_type": "part-time", "images": [], "description": ["\n        ", "\nSmall Manhattan based construction inspection firm looking for an Intern, preferably an architecture or civil Engineering student/ individual to assist with writing field reports related to construction progress, primarily in Manhattan and Brooklyn. This is a freelance position ranging from 10-20 hours per week, working on construction sites and assisting in preparing progress reports. Experience working with MS office, PDF and good reading writing skills is essential. This part time position provides an invaluable opportunity to learn about architectural and structural design aspects of building construction and means and methods. Availability in the mornings is essential.", "\nPlease submit resume    "]},
{"date": "2019-09-06 12:44", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-advanced-designer/6972771312.html", "text": "Intermediate-Advanced Designer Draftsperson w/Project Management exp", "compensation": "TBD based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nOUR TEAM", "\nWe are a full-service interior design firm, focusing primarily on residential, founded over 40 years ago, with a long-standing reputation for designing exceptional, refined environments that balance sustainable function and beauty.  This signature style applies to how we work with all our clients, whether residential, commercial or hospitality.", "\n", "\nDESIGNER/DRAFTSPERSON/PROJECT MANAGER", "\nThe position requires a very result-orientated, efficient and organized individual who is focused on producing the best work possible. The position is best suited to a person with a strong design/interior architecture understanding and background who can assist the Principal Designers in creating construction documentation for contract documents and ongoing project specifications and manage projects during construction administration. ", "\n", "\nRESPONSIBILITIES TO INCLUDE:", "\n-Translate hand sketches into a high level of detail using AutoCAD", "\n-Drafting of Construction Drawings including Demolition & Construction Plans, Lighting Plans & RCPs, Elevations, Sections, Custom Furniture and Millwork drawings & Furniture Plans", "\n-Create detailed elevations from hand sketches and photographs provided by the Principal Designers", "\n-Research, select, input finishes, plumbing fixtures, lighting fixtures, hardware and furnishings into schedules and spec books and update as necessary when changes are made", "\n-Coordinate with contractors, subcontractors, suppliers, and clients from design inception to construction completion", "\n-Site Visits to assist with construction administration and furnishing installation", "\n-Input relevant project documentation into Studio Designer webware", "\n-Request quotes from vendors", "\n-Review Shop Drawings for accuracy", "\n-Provide ongoing SKs and drawing amendments during construction", "\n-Ensure that server organization is maintained", "\n-Take a proactive role with Principals to ensure that they are effectively supported in their project", "\n-Ensure standardized processes are used throughout our design documentation", "\n-Effective reporting of cost and schedule implications to Owner and Principals", "\n", "\n", "\nMINIMUM REQUIREMENTS", "\n3-5 years minimum of AutoCAD experience for a designer or interior architect. A heavy focus on detailing will be essential in this role.", "\nBachelor's degree in Interior Design or Architecture", "\nKnowledge of Google Office Suite", "\nExperience working with Adobe Photoshop and InDesign", "\nExperience with social media for business a plus", "\nExceptional interpersonal and communication skills (verbal & written)", "\nDetail-orientated with a strong focus on accuracy", "\nEfficient in management of time and resources", "\nAbility to manage multiple projects simultaneously and deliver excellent results", "\nPunctual with an outstanding work ethic", "\nStrong, stable prior employment history", "\n", "\nCOMPENSATION", "\nCompetitive compensation package including:", "\nHealth Insurance with HRA", "\nPaid Holidays and paid time off ", "\nAll benefits begin after 3 month waiting period", "\n", "\nREQUIRED APPLICATION STEPS", "\n1. Please reply with cover letter, resume, previous employer references, AND a full construction set from one of your prior projects that includes millwork drawings such as a bath vanity, bookcase, kitchen cabinetry or closet.", "\n2. In one paragraph on your cover letter, please tell us what you will bring to our company culture. ", "\n3. Please enter \"Motivated Team Player -- {Your Last Name}\" in the subject line. ", "\n4. Send all materials to: DesignExcellenceHR@gmail.com", "\n5. Only applicants with materials that are customized for this opportunity will be considered and responded to. ", "\n", "\nNo phone calls or office visits please.", "\nOnly fully qualified individuals need apply    "]},
{"date": "2019-09-06 12:56", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-career-opportunity-in/6972782596.html", "text": "Career Opportunity in Engineering for Immigrant Professionals", "compensation": "Free training in Engineering and IT field with placement assistance!", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nThe Cooper Union Retraining Program for Immigrant Engineers @ CAMBA  assists immigrant Engineers and IT Professionals who are underemployed or unemployed gain access to higher paying jobs through training and job placement assistance. The program includes courses in information technology and mechanical, electrical and civil engineering taught by Cooper Union faculty and field experts.  All services are free and admission is competitive. ", "\nClasses Available:", "\n", "\nEngineering: ", "\n- OSHA 30 for Construction ", "\n- Heating, Ventilation, Air-Condition & Refrigeration", "\n- Building Operation, Maintenance & Safety Regulations", "\n- National Electrical Code (NEC) & its applications", "\n- Bridge, Highway, Tunnels and Buildings: Professional Practice for Cost Estimating", "\n- Green Building Guidelines & Environmental Safety", "\n- AISC Structural Steel Design ", "\n- ACI Structural Concrete Design", "\n- AutoCAD and Revit", "\n", "\nInformation Technology: ", "\n- Data Architecture Principles, Data Structure and SQL", "\n- Java Programming", "\n- Microsoft .NET and C#", "\n- Software Quality Assurance—Manual Testing", "\n- Software Quality Assurance—Automated Testing", "\n- Linux (UNIX) Administration", "\n- Android Software Development", "\n- Cyber Security", "\n", "\nEligibility Requirements:", "\n- Be born outside of the United States and be authorized to work in the United States", "\n- Have a bachelor's degree or higher and professional experience in the field of engineering, information technology, or a related field from the country of origin (not from U.S)", "\n- Have lived in the U.S. less than five full years", "\n- Be unemployed, underemployed, or working in a field not related to your education", "\n- Have intermediate+ English fluency", "\n- Demonstrate a financial need", "\n- Be highly motivated to pursue professional job search", "\n", "\nYou can learn more about us and apply here:  www.cooper.edu/immigrant-retraining.", "\n", "\nPlease call at 718.226.0437 if you have any additional questions about the program or to determine your eligibility.", "\n    "]},
{"date": "2019-09-06 13:11", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-handyman-needed-the-jewish/6972798058.html", "text": "HANDYMAN NEEDED @ The Jewish Board", "compensation": "Highly Competitive!", "employment_type": "full-time", "images": ["https://images.craigslist.org/00w0w_5zg22QICpvK_1200x900.jpg"], "description": ["\n        ", "\n", "    "]},
{"date": "2019-09-06 14:00", "link": "https://newyork.craigslist.org/jsy/egr/d/iselin-mechanical-engineer/6972845171.html", "text": "Mechanical Engineer", "compensation": "55,000-99,000", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nMEP Design related positions only! Please be sure to have 2+ years of experience designing hvac/plumbing systems for buildings using Revit and AutoCAD. Multiple full-time/direct hire positions at different levels.    "]},
{"date": "2019-09-06 14:41", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-draft-person/6972885474.html", "text": "Junior Architect/Draft person", "compensation": "negotiable based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nArchitectural and Engineering firm seeking  Junior Architect/Draft person.", "\nSelf-motivated individual who will interact with our clients .  ", "\nIndividuals should be able to draft floor plans elevations, details and prepare architectural construction documents,", "\nCandidates should be able to work as part of a team as well as independently with limited guidance from senior staff. ", "\nApplicants must have a professional Bachelor's degree from an accredited university.", "\nApplicants must be proficient in AutoCAD, Adobe package, Microsoft Office softwares and 3DSMax.  ", "\n", "\nRequirements: ", "\n•min. 5 years of experience using AutoCAD", "\n•Bachelor's degree related to architectural / engineer ", "\n•Experience with MS Office Suite (Word, Excel, Outlook, and Adobe Acrobat) preferred, InDesign and Photoshop a plus ", "\n•Must be able to understand drawing standards in an architectural setting ", "\n•Highly organized ", "\n•Good verbal and written communication skills ", "\n•Strong attention to detail ", "\n•Ability to self-direct and work independently or with limited supervision", "\nTo Apply:", "\nPlease e-mail your cover letter and resume to the above e-mail with the heading Junior Architect. No phone calls, email only.", "\n", "\n    "]},
{"date": "2019-09-07 10:34", "link": "https://newyork.craigslist.org/brk/egr/d/steel-detailer/6973397500.html", "text": "Steel Detailer", "compensation": "pay based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nStructural Steel and Miscellaneous Iron Fabricator is seeking a experienced in house steel detailer. ", "\n", "\nMust be proficient with 3-d modeling programs such as TEKLA,and/or ADVANCE STEEL. ", "\n", "\nWe offer a highly competitive salary with year end bonus.", "\n", "\nIf you are interested in working for a growing, aggressive company, e-mail your resume with salary requirements    "]},
{"date": "2019-09-06 14:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-job-captain/6972897008.html", "text": "Architectural Job Captain", "compensation": "Competitive Salary - DOE", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nSBLM New York office looks for a highly motivated Job Captain who is a team player with excellent REVIT skills. Ideal candidate will be a well-organized, detail-oriented individual who is accustomed to working on and leading the production of multiple projects. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3+ years’ experience in an Architect’s office working on Commercial/Retail projects", "\nMust be proficient in Revit and other applicable industry software is a must", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary and benefits package commensurate with the level of experience and a creative and innovative work environment.", "\n•\tOur benefit package includes Medical/Dental/Vision insurance, 401k Retirement Plan, Flexible Spending, Paid Time Off, Holidays and much more.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational programs.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Job Captain in the subject. No phone calls, please. ", "\n", "\n    "]},
{"date": "2019-09-06 18:12", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6973066671.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/00M0M_hTSvAd8p6K0_1200x900.jpg"], "description": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-06 18:13", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/6973067281.html", "text": "Facade / Building Envelope Architect", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2 to 5 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-07 10:59", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-construction-estimator/6973417789.html", "text": "Construction Estimator", "compensation": "Salary commensurate with experience", "employment_type": "full-time", "images": ["https://images.craigslist.org/00o0o_i9WwhzsbZXc_1200x900.jpg"], "description": ["\n        ", "\nAIK Renovations is a fast growing commercial and residential construction company in the metropolitan New York area. We are actively seeking experienced Estimators for employment in our Long Island City office .", "\n", "\n-Candidates must have experience estimating construction projects in the local area.", "\n", "\nOther Requirements Include:", "\n", "\n-Knowledge of the construction industry (both residential and commercial), with a focus on interior renovation work.", "\n", "\n-Must be able to multitask and effectively manage multiple projects simultaneously.", "\n", "\n-Excellent written and verbal communication skills and meticulous attention to detail are requirements.", "\n", "\n-Must be able to work independently and as part of a dynamic team.", "\n", "\n-Be able to review and perform full breakdowns of construction drawings, specifications and bid forms. Gather all material quotes and or sub-contractor quotes necessary to construct cost estimates.", "\n", "\n-Ability to create project schedules/timelines.", "\n", "\n-Develop the scope of work for sub-contractors and assist in the buy-out procedures.", "\n", "\n-Complete understanding of subcontracting and procurement strategies.", "\n", "\n-Must have several years of successful experience in the field to be hired.", "\n", "\n", "\nAbout AIK Renovations:", "\nAIK is a leading commercial and residential contractor based in New York City. Incorporating the highest quality materials and state-of-the-art construction techniques in conjunction with superior project coordination and construction supervision, AIK strives to surpass our clients’ expectations while delivering unique projects on time and within budget.    "]},
{"date": "2019-09-08 14:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-assistant-cm-estimator-admin/6974234174.html", "text": "Assistant CM/ Estimator/ Admin for Developer/ CM", "compensation": "TBD", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nCM/ Developer in better Condo, Townhouse and Commercial work seeks experienced Administrator with strong background and abilities in both Estimating and Administration.", "\n", "\nResponsibilities are varied and include", "\n", "\n•\tBudgets and Estimating", "\n o\t]Outline and Schedule Estimating requirements for On Time Delivery.", "\n o\tSet up Excel Workbooks with Trade Pages and Summary for CSI Estimates and Developer Budgets.", "\n o\tOrganize and Distribute Bid Packages to Contractors and Vendors and Follow-up.", "\n o\tTakeoffs for Carpentry, Millwork, Finishes and other Trades", "\n o\tGenerate Tender Reports for Lender Compliance.", "\n o\tAssemble information from various sources including Consulting Estimators, Trade Vendors and Self.", "\n", "\nAdministrative", "\n", "\n o\tMaintain Site Reports in conjunction with Foremen and Site Superintendents", "\n o\tAttend Site Meetings and Distribute Meeting Minutes.", "\n o\tG703 Payment Applications for Trade Contractors", "\n o\tContractors Progress Reports", "\n o\tLender Reports and associated documentation and Photo Presentations", "\n o\tTrack and Facilitate Sign Offs", "\n", "\nGeneral Skills", "\n", "\n o\tMust Write and Speak well.", "\n o\tHigh proficiency in Excel", "\n o     Proficiency in Microsoft Project, Smartsheet or similar Excel Based Scheduling Programs.", "\n o\tMinimum 10 years’ experience or 5 Years plus related Education.", "\n", "\nPlease respond with Resume, availability and Salary Requirements. If you list your Salary Requirements as “Negotiable” we will not respond.", "\n", "\nImmediate", "\n    "]},
{"date": "2019-09-08 23:26", "link": "https://newyork.craigslist.org/fct/egr/d/dover-afb-3-junior-engineers/6974526705.html", "text": "3 Junior Engineers", "compensation": "To be discussed with the Hiring Manager", "employment_type": "contract", "images": [], "description": ["\n        ", "\nPlanate Management Group is a Service-Disabled Veteran-Owned Small Business (SDVOSB) headquartered in Alexandria, Virginia, USA with a technical support center in the Philippines that provides program management and facilities engineering services worldwide. Planate is a small business provider of planning, design, infrastructure management, technical consulting, engineering, and construction management services in support of the US Department of Defense (DOD) and its Service missions (Army, Air Force, Navy, Marine Corps), along with other US federal agencies.", "\n", "\nThe Junior Engineers will be responsible for assisting the squadron with several construction/repair projects which consist all aspects of engineering works to support the Air Force Base in Dover, Delaware. ", "\n", "\nThis position is contingent on the award of the contract. Contract duration will be one year plus two option years.", "\n", "\nKey responsibilities:", "\n•\tPerforms planning and design work for substantial multi-phase new construction, renovation, and improvement projects for a variety of real property facilities, including utility systems, utilizing a professional knowledge of (electrical/ Mechanical/ Civil) engineering. Orchestrates the planning, design, cost estimating and phased scheduling of assigned projects including completion of required project forms and economic analyses", "\n•\t Serves as consulting engineer on all design aspects of assigned projects but specifically knowledgeable and qualified to review and approve engineering details of projects.", "\n•\tCoordinates the preparation of and reviews statements of work (SOW)", "\n•\tReviews Design-Build and Design-Bid-Build packages and works with contracting personnel as a technical expert to negotiate Government construction contracts", "\n•\tCoordinates projects with engineers in other disciplines or with architects", "\n•\tKeeps abreast of emerging technologies to ensure programmed development will not prematurely become obsolete", "\n•\tComplies with health, safety, and environmental rules and procedures and performs work in a manner that enhances safety of the work environment", "\n•\tPerforms other responsibilities associated with this position as may be appropriate.", "\n", "\nQualifications to be successful in the role:", "\n", "\n•\tRequired personnel:  Degree in (1) Electrical Engineer (1) Civil Engineer (1) Mechanical Engineer ", "\n•\tEngineering Degree OR minimum of two (2) years work experience in respective discipline", "\n•\tAble to perform tasks in a team environment", "\n•\tProficient with Microsoft Office products and able to adapt to other software used to manage and track assigned projects ", "\n•\tProficient in English both written and oral", "\n•\tMust be US Citizen.", "\n", "\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex or national origin.", "\n    "]},
{"date": "2019-09-09 00:29", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-asst-project-designer/6974543245.html", "text": "Asst Project Designer / Office Manager", "compensation": "Base Salary 55-65k plus overall package", "employment_type": "full-time", "images": [], "description": ["\n        ", "\n***Our apologies, but the responses that we recieved over the last few weeks were deleted in error.  If you have previously applied, please feel free to resend your information and thank you!", "\n", "\n", "\nAssistant Project Designer / Office Manager at The Renovated Home., which is located at our showroom at 401 East 76th Street, New York, NY 10021.", "\n", "\nPosition Duties:", "\n• Manage all facets of the operations of the office and design studio. Inventory management, supplies, etc. ", "\n• Fully involved in all facets of projects underway, coordination with the project designers on staffing and subcontractor", "\non upcoming projects.", "\n• Handle and coordinate all facets of service work for past clients through completion.", "\n• Involvement on scheduling throughout the trades and vendors on all ongoing projects.", "\n• Monitor, organize, shadow and follow up on all emails sent to Our presidents TRH mailbox.", "\n• Continually oversee the vendors and add contractors and sourcing to our team as appropriate and available.", "\n• Liaison with clients as needed.", "\n• Tracking / Scheduling / and coordinating site meetings throughout the project process as well as management of the", "\nproject", "\n", "\n", "\n", "\nPlease send resume and any pertinent information that might give us a sense of what makes you the ROCKSTAR we are looking for! ", "\n", "\n    "]},
{"date": "2019-09-09 11:07", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-senior-interior/6974740601.html", "text": "Intermediate/Senior Interior Designer", "compensation": "Competitive based on years of experience and design skill", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nDowntown design studio, teeming with new work seeks an Intermediate and Senior Designer to work alongside Creative Director on new local residential developments. Firm has deep-rooted connections within leading NYC development community, and working on ambitious projects of varying scale. This is an opportunity for motivated designers to be hands-on in creating narratives/concepts, and build schemes through project install. ", "\n", "\nThe role requires strong concept and design development experience. Must be able to work with clients, build storylines, and develop comprehensive schemes, with great attention to FF&E. Must be able to produce some furniture and DD plans in AutoCAD, but position is more creatively focused. ", "\n", "\nTaste level and knowledge of FF&E are critical. Demonstrated success presenting to clients is a plus. Ability to coordinate and manage vendors, fabricators, consultants in meetings and on-site are required. 3-7+ years of professional experience. ", "\n", "\nSubmit resume and portfolio samples for immediate response.    "]},
{"date": "2019-09-09 17:17", "link": "https://newyork.craigslist.org/que/egr/d/civil-engineer-student-wanted-entry/6975097406.html", "text": "Civil Engineer/Student Wanted - Entry Level Position", "compensation": "To be discussed", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nLooking for a worker at a construction company based in Astoria:", "\nJob opening for a Civil engineer, at entry level position. ", "\nWe will provide comprehensive on the job training.", "\n", "\nRequirements are as follows: ", "\nTeam work, ", "\nMust be able to elaborate bids and estimates, ", "\nMust be able to generate and read blue prints, ", "\nMust be able to work under pressure and meet all deadlines.", "\nAUTOCAD great plus.", "\n", "\nPlease email resume.", "\n    "]},
{"date": "2019-09-09 13:06", "link": "https://newyork.craigslist.org/brk/egr/d/design-fabrication-shop-looking-for-cad/6974861440.html", "text": "Design/Fabrication Shop looking for CAD/CAM Specialist", "compensation": "commensurate with experience, on W2, paid vacation, sick time, holidays", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nWe are a small shop in Williamsburg specializing in fine art fabrication, product development, engineering, prototyping, and making almost anything. ", "\n", "\nDuties:", "\n", "\n-Build 3D models in Solidworks/Rhino/Fusion360", "\n-Create sheet layouts from Illustrator/dxf files", "\n-Generate CAM files from models/drawings", "\n-Load and run CNC mill and router", "\n-Create shop drawings & technical control drawings", "\n-Basic assembly and finishing", "\n", "\n", "\nRequirements:", "\n", "\n-Must have minimum 1 year experience using CNC machines (machine setup, file generation, operation). VisualMill / Fusion360 preferred.", "\n-Minimum 1 year experience using 3D modeling software. Solidworks / Fusion360 preferred.", "\n-Experience using various power tools (drills, saws, sanders, etc)", "\n", "\n", "\nPlease send resume and portfolio for consideration.", "\n", "\nInstagram: @rushdesignnyc", "\n", "\nWeb: www.rushdesign.net    "]},
{"date": "2019-09-09 14:04", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-interior/6974920380.html", "text": "Architect/ Interior Designer", "compensation": "Base on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nRADU ARCHITECTS is seeking full-time Architect/ Interior Designer with 5- 7 years' experience in all aspects of design and production. Candidate must be able to manage more than one project at one time varying in size.", "\nCandidate should have experience in dealing with clients.", "\nCandidate should have good design sense and be knowledgeable in construction documents. The Architect will be responsible for all or some of the project phases such as; Schematic Design, Design Development, Construction Documents, Custom Millwork Detail and Shop Drawings Review.", "\nPrerequisites:", "\n1.\t5-7 years' experience working for a NYC Architectural Firm/ Interior Design firm.", "\n2.\tProficient in producing CD's ", "\n3.\tProject Management/Consultants coordination.", "\n4.\tClient relations experience", "\n5.\tGood design sense.", "\n6.\tTechnical knowledge of NYC building codes and NYC zoning.", "\n7.\tNY Professional License a plus.", "\nCandidate Qualifications:", "\n1.\tExcellent oral and written communication skills.", "\n2.\tProficient in creating coordinated construction document sets.", "\n3.\tResolves technical and code issues.", "\n4.\tOrganize, schedule and administer project constructability schedule.", "\n5.\tProduce Schematic Design Proposals.", "\n", "\n    "]},
{"date": "2019-09-10 10:57", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-structural-engineers-needed/6975508123.html", "text": "Structural Engineers Needed!", "compensation": "Competitive salary, comprehensive benefits, 401K, structured bonus program", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nMurray Engineering is rapidly growing, and we are seeking highly motivated Structural Engineers to join our team! Our diverse portfolio consists of new construction as well as renovations/alterations to existing buildings. We have a large client base that provides us with a wide array of projects that include commercial, cultural,institutional, retail, and single/multi-family residential properties as well as special structures.", "\n", "\nWe are dedicated to using an innovative design and team-oriented approach that contributes to the success of our clients, the growth of our employees and a positive impact in our community.", "\n", "\nOur firm offers a competitive salary, comprehensive benefits, 401K, structured bonus program, and opportunities for advancement. Our employees are encouraged to participate in professional development groups and activities.", "\n", "\nPositions available require the following:", "\n*Excellent written and verbal communication skills.", "\n*Bachelor’s degree in civil engineering with a structural concentration.", "\n*Master’s degree in Civil or Structural Engineering preferred, but not required.", "\n*FE/EIT certification, preferred.", "\n*1-5 years of experience.", "\n*Strong attention to detail with excellent analytical and judgment capabilities required.", "\n*Well-organized.", "\n*Ability to effectively work independently and in a team environment required.", "\n*Strong computer skills.", "\n*Passion for problem solving and responsibility.", "\n", "\n    "]},
{"date": "2019-09-10 11:23", "link": "https://newyork.craigslist.org/mnh/egr/d/architect-intermediate/6975531688.html", "text": "Architect, Intermediate", "compensation": "Commensurate with experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nTribeca office seeks intermediate Architect for work including new commercial and residential construction.  This is a great opportunity for professional growth with exposure to all aspects of architectural practice.  Candidate must be knowledgeable, with good communication skills, and must be willing and able to take on responsibility.  Vectorworks a plus.", "\n", "\nSend resume, portfolio less than 3MB, availability, salary requirements    "]},
{"date": "2019-09-10 11:28", "link": "https://newyork.craigslist.org/mnh/egr/d/revit-bim-operator/6975536506.html", "text": "REVIT / BIM Operator", "compensation": "Competitive...based on previous experience.", "employment_type": "contract", "images": [], "description": ["\n        ", "\nLeading national provider of building measurement services is seeking a qualified BIM Operator / Draftsperson with high level of work experience in Revit. ", "\n", "\nCandidates for this position require previous experience accurately capturing and drafting \"as-built\" environments and conditions in REVIT. Position requires the ability to collaborate with our team, measure and produce Revit model for both commercial and residential projects nationwide. Ability to use 3D laser scanner a plus - but not a requirement.  ", "\n", "\nKindly email resume along with three (3) examples of previous Revit work in PDF format. ", "\n", "\n    "]},
{"date": "2019-09-10 13:09", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-construction-mechanical-inspector/6975632362.html", "text": "Construction Mechanical Inspector", "compensation": "Based on experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nWe are seeking a graduated mechanical engineer to conduct building inspections pertaining to TR1 forms for the Dept. of Buildings for new buildings and alteration jobs.", "\n", "\nThe ideal candidate:", "\n", "\n- Must have a mechanical engineering degree.", "\n", "\n- Must be knowledgeable of the building code", "\n", "\n- Must be reliable and willing to travel to all the 5 boroughs of NYC", "\n", "\n- Must have or be willing to obtain ICC mechanical certification", "\n", "\n- Must be able to read and understand construction plans", "\n", "\nPay: TBD with experience", "\n", "\n    "]},
{"date": "2019-09-10 17:25", "link": "https://newyork.craigslist.org/que/egr/d/woodside-earn-up-to-18-hr-deliver-with/6975862859.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "employment_type": "contract", "images": [], "description": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-11 11:31", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architectural-designer/6976291274.html", "text": "Architectural Designer", "compensation": "Commensurate w/ experience", "employment_type": "full-time", "images": [], "description": ["\n        ", "\nBWArchitects is a multi-disciplinary firm that specializes is high end residential, hospitality and special events. Our projects are based in NYC, California and Europe. We have exciting new opportunities and are looking for a key member to join our team.", "\n", "\nQualifications: ", "\n", "\nProfessional degree in Architecture (required)", "\n3 - 5 years of post graduate experience in NYC", "\nSTRONG design, technical and graphic skills", "\nEXCELLENT organizational and communication skills", "\nModel making experience a PLUS", "\n", "\nOur work tools are Mac based Vectorworks, Sketchup, Rhino, Maxwell Render and the Adobe Creative Suite. Knowledge of the Mac OS and programs is not required but a is a big plus.", "\n", "\nWe are searching for a candidate who will be the right fit for our company culture.", "\n", "\nWe are a design and detail oriented firm with a rigorous approach to our work. Our clients are important and so are our families. ", "\n", "\nMore info about us at www.bw-architects.com", "\n", "\nIf interested, please email us your resume and samples of relevant experience, graphic and technical and the dates when you are available to start work.", "\n", "\nThe position comes with an immediate start date but we will wait for the right candidate. Salary is dependent on experience. Range 65k-80k", "\n    "]}
]